<h1>DDB CMS Manual - Konfiguration</h1>

<p><em>Opdateret den 8. februar 2019</em></p>

<p><a href="//pdfcrowd.com/url_to_pdf/">Gem manualen som PDF</a></p>

<p>{{>toc}}</p>

<p><img alt="" data-rich-file-id="28" src="/system/rich/rich_files/rich_files/000/000/028/original/forsiden_dump.png" style="border-width: 2px; border-style: solid;" /></p>

<h2 id="om-vejledningen">Om vejledningen</h2>

<p>Vejledningen beskriver de forskellige konfigurationsmuligheder i DDB CMS. Vejledninger har prim&aelig;rt et teknisk fokus, og er rettet mod medarbejdere, som skal h&aring;ndtere den tekniske ops&aelig;tning/konfiguration af hjemmesiden - f.eks. som webmaster eller lignende. Hvis du prim&aelig;rt s&oslash;ger vejledning til DDB CMS&rsquo; redaktionelle funktioner anbefales &ldquo;DDB CMS Manualen&rdquo;.</p>

<p>Hvis du ikke tidligere har arbejdet med DDB CMS kan det anbefales f&oslash;rst at l&aelig;se afsnittet &ldquo;S&aring;dan er DDB CMS struktureret&rdquo; i &ldquo;DDB CMS Manualen&rdquo;, der giver en overordnet beskrivelse af sitets struktur og pointen med de forskellige strukturelle elementer.</p>

<h2 id="anvendt-notation">Anvendt notation</h2>

<h3 id="notation">Notation</h3>

<p>Nogle steder i vejledningen er der behov for at henvise til hele eller dele af URL&#39;en.<br />
Det foreg&aring;r s&aring;dan:</p>

<ul>
	<li>Tekst i &ldquo;[ ]&rdquo; indikerer, at der er forskelle alt efter hvilket biblioteks hjemmeside der henvises til.</li>
	<li>Ved henvisning til undersider udelades bibliotekets adresse s&aring; http://www.biblioteketsnavn.dk fjernes og det er kun den relative-URL, der er tilbage f.eks. &ldquo;/stiens navn&rdquo;</li>
	<li>Ved henvisninger til undersider, der er individuelle for hvert biblioteket inds&aelig;ttes [BIBLIOTEKETS_NAVN] i URL&#39;en.</li>
</ul>

<h3 id="sti-til-funktioner">Sti til funktioner</h3>

<p>I nogle afsnit beskrives funktioner, hvor en admin-sti er angivet i parentes, f.eks. (Sti: admin/structure/menu/manage/main-menu). Du kan bruge stien i stedet for at klikke dig frem til den p&aring;g&aelig;ldende funktion. Du kan enten skrive stien ind direkte efter hjemmesidenavnet (husk / efter hjemmesidenavnet): f.eks. []/admin/structure/menu/manage/main-menu</p>

<p>Eller du kan p&aring; alle jeres sider efter sidens adresse skrive #overlay= og derefter stien: f.eks. []/arrangementer#overlay=admin/config/ting/resevable</p>

<h2 id="farver-og-grænseflade">Farver og logo</h2>

<h3 id="skift-logo-på-hjemmesiden">Skift logo p&aring; hjemmesiden</h3>

<p>I &oslash;verste venstre hj&oslash;rne af DDB CMS vises som udgangspunkt logoet for Danskernes Digitale Biblioteker. For at skifte logoet g&oslash;r du f&oslash;lgende:</p>

<p>Fremgangsm&aring;de:</p>

<ol>
	<li>Klik ind p&aring; &ldquo;Udseende -&gt; Indstillinger (ved &ldquo;DDBasic (standardtema)&rdquo; )&ldquo; (Sti: admin/appearance/settings/ddbasic).<br />
	<img alt="" src="http://platform.dandigbib.org/attachments/download/263/Logo.png" style="border-width: 2px; border-style: solid; width: 900px; height: 103px;" /></li>
	<li>Under afsnittet &ldquo;Logo&rdquo;: Fjern markering ved &ldquo;Brug standard logo&rdquo;.<br />
	<img alt="" src="http://platform.dandigbib.org/attachments/download/264/Logo_udfoldet.png" style="border-width: 2px; border-style: solid; width: 900px; height: 273px;" /></li>
	<li>Upload fil. OBS. Anbefalet h&oslash;jde er 44px og fleksibel bredde.</li>
	<li>Tryk p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h4>Visning af logo/biblioteksnavn p&aring; mobilvisning</h4>

<p>Ved sk&aelig;rme mindre end 600px bredde vises logoet ikke. &Oslash;nskes bibliotekets navn vist i stedet, skal &quot;Sitets navn&quot; v&aelig;re sl&aring;et til under Udseende&gt; Indstilliger&gt; DDBasic V 2.0 (Sti: admin/appearance/settings/ddbasic) og Sitets navn skal v&aelig;re udfyldt under Indstillinger &gt; System &gt; Generel information (Sti:admin/config/system/site-information).</p>

<h3 id="skift-farver-på-hjemmesiden">Skift farver p&aring; hjemmesiden</h3>

<p>DDB CMS giver en r&aelig;kke muligheder for at tilpasse farverne, s&aring; de f.eks. afspejler bibliotekets &oslash;vrige visuelle udtryk. Nedenfor er en pr&aelig;sentation af de forskellige indstillingsmuligheder.</p>

<p>OBS. For at &aelig;ndre i farvetemaet kr&aelig;ver det rettigheder som &ldquo;Lokal administrator&rdquo;.</p>

<h4 id="kort-om-farver-og-tilgængelighed">Kort om farver og tilg&aelig;ngelighed</h4>

<p>Tilg&aelig;ngelighed handler om at give flest mulige mennesker adgang til indholdet p&aring; din hjemmeside. Med det forkerte farvevalg kan indhold og funktionalitet blive umulig at l&aelig;se og bruge for borgere med forskellige former for synsneds&aelig;ttelse og lignende.</p>

<p>Det er derfor vigtigt at overholde standarder for farvevalg, som beskrevet i en r&aelig;kke internationale retningslinjer for tilg&aelig;ngelighed p&aring; nettet, der hedder WCAG 2.0 (Web Content Accessibility Guidelines 2.0). Offentlige myndigheder i Danmark er forpligtet til at overholde WCAG 2.0 p&aring; niveau A og AA.</p>

<p>WCAG2 specificerer bl.a. krav til kontrastforholdet mellem elementer p&aring; hjemmesiden.</p>

<p>P&aring; nettet findes v&aelig;rkt&oslash;jer, som kan teste om dine farvevalg overholder WCAG2 f.eks. http://webaim.org/resources/contrastchecker/ eller http://www.dasplankton.de/portfolio-item/contrast-a/.</p>

<h4 id="sådan-ændrer-du-farve-på-hjemmesiden">S&aring;dan &aelig;ndrer du farve p&aring; hjemmesiden</h4>

<ol>
	<li>Klik ind p&aring; &ldquo;Udseende -&gt; Indstillinger (ved &ldquo;DDBasic V2.0 (standardtema)&rdquo; )&ldquo; (Sti: admin/appearance/settings/ddbasic).</li>
	<li>Under sektionen &ldquo;Farvevalg&rdquo; v&aelig;lges &quot;Tilpasset&quot; og farveindstillinger for de forskellige omr&aring;der af hjemmesiden kan herefter indstilles.</li>
	<li>Tryk p&aring; knappen &ldquo;Gem indstillinger&rdquo; i bunden af siden.</li>
</ol>

<p><img alt="" data-rich-file-id="363" src="/system/rich/rich_files/rich_files/000/000/363/original/2018-03-13%2010_27_42-Udseende%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid; width: 300px; height: 108px;" /></p>

<h4 id="gennemgang-af-redigeringsmulighederne">Gennemgang af redigeringsmulighederne</h4>

<p>Nedenfor er en kort gennemgang af de forskellige muligheder for at justere farverne fra redigeringsgr&aelig;nsefladen i DDB CMS:</p>

<ul>
	<li>Prim&aelig;r</li>
	<li>Sekund&aelig;r</li>
	<li>Tekst</li>
	<li>Text link</li>
	<li>Text on primary</li>
	<li>Text on secondary</li>
</ul>

<p>Farvesammens&aelig;tningen best&aring;r af en prim&aelig;r og en sekund&aelig;r farve samt en tekstfarve. Den prim&aelig;re farve benyttes blandt andet som&nbsp;baggrundsfarve i hovedmenuen, mens den sekund&aelig;re farve benyttes til at fremh&aelig;ve handlingsknapper. Man kan dog v&aelig;lge, at den prim&aelig;re og den sekund&aelig;re farve er den samme.</p>

<p>Tekstfarven kan defineres som en tilh&oslash;rende s&aring;vel som den prim&aelig;re som den sekund&aelig;re farve. Eftersom tekstfarven skal v&aelig;re l&aelig;sbar, giver systemet valget i mellem sort og hvid samt den prim&aelig;re og den sekund&aelig;re farve.</p>

<p>I det nye design anvendes fonten Fakt Pro. Fakt Pro er designet til sk&aelig;rmbrug og er baseret p&aring; elementer fra Helvetica og Futura. Der benyttes fem forskellige skriftst&oslash;rrelser.</p>

<p>Se eksempel p&aring; skrifttype og -st&oslash;rrelse her: [[http://devdraft.server003.b14cms.dk/node/706/b14view/ab1b5590#57]].</p>

<p>Biblioteker p&aring; webmaster-l&oslash;sningen kan v&aelig;lge at udskifte skrifttypen.</p>

<h5 id="primær">Prim&aelig;r</h5>

<p>&ldquo;Prim&aelig;r&rdquo; definerer baggrundsfarven for hovedmenuen, checkboxes og radioknapper.</p>

<p>Farven p&aring; &ldquo;Prim&aelig;r&rdquo; er som udgangspunkt st&oslash;vet bl&aring; (farvekode: #4d898e).</p>

<p><img alt="" data-rich-file-id="364" src="/system/rich/rich_files/rich_files/000/000/364/original/2018-03-13%2010_38_26-Udseende%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h5 id="sekundær">Sekund&aelig;r</h5>

<p>Sekund&aelig;rfarven bruges som baggrundsfarve for log-ind knappen, pileknapper p&aring; karruseller etc.<br />
Farven p&aring; &quot;Sekund&aelig;r&quot; er som udgangspunkt koralfarvet (farvekode: #f66d70)</p>

<p><img alt="" data-rich-file-id="365" src="/system/rich/rich_files/rich_files/000/000/365/original/2018-03-13%2010_38_41-Udseende%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h5 id="tekst">Tekst</h5>

<p>&quot;Tekst&quot; definerer farven p&aring; tekst-links og paneloverskrifter.<br />
V&aelig;lg en farve, som er l&aelig;selig p&aring; hvid baggrund.</p>

<p>V&aelig;lg mellem: Sort, Prim&aelig;r og Sekund&aelig;r.<br />
Standardfarven er sort, men &oslash;nskes farvede emneord og tekstlinks, skal denne skiftes til prim&aelig;r eller sekund&aelig;r.</p>

<p><img alt="" data-rich-file-id="366" src="/system/rich/rich_files/rich_files/000/000/366/original/2018-03-13%2010_38_53-Udseende%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h5 id="text-link">Text link</h5>

<p>&quot;Text link&quot; definerer farven p&aring; tekstlinks inde i br&oslash;dteksten.<br />
Her kan v&aelig;lges mellem Prim&aelig;r og Sekund&aelig;r tekstfarve.</p>

<h5 id="text-on-primary">Text on primary</h5>

<p>&ldquo;Text on primary&rdquo; definerer farven p&aring; tekster, der vises p&aring; baggrund af prim&aelig;rfarven.<br />
Her kan v&aelig;lges mellem Hvid og Sort. Standardvisningen er Hvid.</p>

<h5 id="text-on-secondary">Text on secondary</h5>

<p>&ldquo;Text on primary&rdquo; definerer farven p&aring; tekster, der vises p&aring; baggrund af sekund&aelig;rfarven.<br />
Her kan v&aelig;lges mellem Hvid og Sort. Standardvisningen er Hvid.</p>

<h3 id="indsæt-et-baggrundsbillede">Inds&aelig;t et baggrundsbillede</h3>

<p>I DDB CMS er det muligt at inds&aelig;tte et baggrundsbillede for hjemmesiden. OBS. For bedst mulige resultat anbefales en billedst&oslash;rrelse p&aring; 2560px1440px. Husk at komprimere billedet, for at mindske indl&aelig;sningstiden hos slutbrugerne.</p>

<p>Fremgangsm&aring;de: S&aring;dan inds&aelig;tter du et baggrundsbillede p&aring; hjemmesiden</p>

<ol>
	<li>Klik p&aring; &ldquo;Backgrounds&rdquo; i genvejsmenuen. Alternativt kan du finde &ldquo;Backgrounds&rdquo; under (Sti: admin/config/user-interface/backgrounds)</li>
	<li>Klik p&aring; &ldquo;V&aelig;lg fil&rdquo; og find det billede, du &oslash;nsker at bruge.</li>
	<li>Ud for &ldquo;Background image 1&rdquo; s&aelig;tter du flueben ud for &ldquo;Use picture as the site&#39;s default background&rdquo;.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
	<li>Hvis billedet ikke vises, skal du rydde cachen. Klik p&aring; &ldquo;Ryd alle cacher&rdquo; under Indstillinger -&gt; Ydelser (Sti: admin/config/development/performance).</li>
</ol>

<h3 id="skift-favicongenvejsikon-for-hjemmesiden">Skift favicon/genvejsikon for hjemmesiden</h3>

<p>Som udgangspunkt anvendes drupals standardlogo som favicon/genvejsikon: <img alt="" data-rich-file-id="395" src="/system/rich/rich_files/rich_files/000/000/395/original/drupal.png" /></p>

<p>Det er muligt at skifte ikonet p&aring; f&oslash;lgende m&aring;de:</p>

<ol>
	<li>&Aring;ben &ldquo;Udseende -&gt; Indstillinger (under DDBasic V 2.0 (standardtema)) -&gt; Indstillinger for genvejsikon (fane nederst p&aring; siden)&rdquo; (Sti: admin/appearance/settings/ddbasic).</li>
	<li>Fjern fluebenet i checkboksen &ldquo;Brug standard genvejsikonet&rdquo;.</li>
	<li>Upload ikon eller inds&aelig;t sti til det billede du &oslash;nsker at anvende.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h3>Disable Ting Object Overlay</h3>

<p>Det er muligt at fjerne den gr&aring; gradient med tekst, som l&aelig;gger sig hen over materialeforsiderne i diverse karruseller. Dette g&oslash;res ved at s&aelig;tte flueben i Disable overlay. (Sti: /admin/appearance/settings/ddbasic). Overlayet bliver vist som standard.</p>

<p><img alt="" data-rich-file-id="368" src="/system/rich/rich_files/rich_files/000/000/368/original/2018-03-13%2010_43_54-_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid; width: 500px; height: 267px;" /></p>

<p><img alt="" data-rich-file-id="367" src="/system/rich/rich_files/rich_files/000/000/367/original/2018-03-13%2010_44_39-_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid; width: 500px; height: 267px;" /></p>

<h2>Personalisering</h2>

<p>Under /admin/config/ding/serendipity er foruddefineret en yderligere fallback-s&oslash;gestreng (facet.type=bog), som serendipitetsmodulet falder tilbage p&aring;, hvis den mangler indhold. Denne kan ogs&aring; &aelig;ndres, ligesom ledsageteksten &quot;Biblioteket anbefaler&quot; kan redigeres. Det vil is&aelig;r v&aelig;re indhold fra denne s&oslash;gning, anonyme brugere f&aring;r vist. Her kan &quot;Gr&aelig;nse for hvorn&aring;r serendipitetsopslag markeres som for langsomme&quot; ogs&aring; &aelig;ndres.</p>

<p><img alt="" data-rich-file-id="30" src="/system/rich/rich_files/rich_files/000/000/030/original/Ding%20serendipity.JPG" style="border-width: 2px; border-style: solid;" /></p>

<h5>Uddybende forklaring p&aring; serendipitetsfunktionen</h5>

<p>Serendipitetsmodulet er et system til at indsamle materialeforslag p&aring; baggrund af f.eks. et s&aelig;rskilt materiale eller en brugers personlige lister. Serendipitetsmodulet indsamler forslag fra hver af de individuelle serendipitetsplugins, som hver is&aelig;r har en simpel strategi for indsamling. F.eks. tager Forfatter-plugin et tilf&aelig;ldigt materiale fra l&aring;nerens 50 sidste l&aring;n, og sl&aring;r op i Br&oslash;nden efter tilsvarende materialer med samme materialetype, sprog og forfatter. ADHL-plugin finder p&aring; baggrund af et materiale (via OpenList) hvad andre typisk ogs&aring; l&aring;ner ift. det givne materiale. Indsamling af forslag forl&oslash;ber i f&oslash;lgende trin: Et panel p&aring; en given side eftersp&oslash;rger et antal forslag i en given kontekst. Eksempelvis vil man p&aring; en materialeside have materialet som kontekst, p&aring; forsiden kan man for anonyme bes&oslash;gende have en anonym bruger som kontekst eller en indlogget l&aring;ner med alle dennes lister som kontekst. Serendipitetsmodulet grupperer nu plugins efter v&aelig;gt, laveste v&aelig;gt f&oslash;rst, hvorefter alle plugins med samme v&aelig;gt foresp&oslash;rges efter forslag. S&aring; snart det eftersp&oslash;rgte antal forslag er fundet stopper foresp&oslash;rgslen. Mangler der stadig forslag n&aring;r alle plugins i en v&aelig;gtgruppe er forespurgt, foresp&oslash;rges alle plugins i n&aelig;ste v&aelig;gtgruppe. Ved at tildele plugins samme v&aelig;gt sikrer man at forskellige indsamlingsstrategier bliver blandet godt for brugeren. Mindre vigtige plugins eller mere generelle plugins tildeles s&aring;ledes tungere v&aelig;gte. Dvs at plugins med v&aelig;rdien 50 vises oftere end plugins med v&aelig;rdien 10. Hvis der afslutningsvis ikke er fundet det &oslash;nskede antal forslag kan der hentes forslag fra et fallback plugin, som forventes at garantere et resultat. Typisk vil man p&aring; forsiden supplere med f.eks. &quot;facet.type=bog&quot; sorteret efter nyeste udgivelse.</p>

<h3 id="webtrends">Open List - Brugeroprettede lister</h3>

<p>Brugerne kan oprette deres egne lister. Disse kan g&oslash;res offentlige og kommer automatisk til at ligge p&aring; siden [BIBLIOTEKSNAVN.DK/public-lists]<br />
Det er op til den enkelte redaktion at synligg&oslash;re de offentlige lister, enten ved at lave et link til siden i menustrukturen http://platform.dandigbib.org/projects/ddb-cms/wiki/Manual_til_DDB_CMS#Sådan-tilføjer-du-et-menupunkt-til-hovedmenuen eller ved at lave en nyhed om funktionen.<br />
Ved at lede brugerne hen p&aring; siden med de offentliggjorte lister kan de blive opm&aelig;rksomme p&aring; listefunktionen uden selv at have oprettet en liste. Herfra kan de ogs&aring; v&aelig;lge at f&oslash;lge andre brugeres lister.</p>

<p>N&aring;r en bruger har oprettet en liste, bliver brugeren via en pop-up besked henvist til siden [BIBLIOTEKSNAVN.DK/help/lists] hvor man kan l&aelig;se mere om hvordan lister kan bruges.<br />
Biblioteket skal <strong>selv</strong> oprette denne side - dette g&oslash;res ved at oprette en side og &aelig;ndre aliaset til help/lists (Se hvordan p&aring; http://platform.dandigbib.org/projects/ddb-cms/wiki/Manual_til_DDB_CMS#Opret-en-Side)</p>

<h3>User consent / Samtykke</h3>

<p><strong>Tidligere l&aring;n</strong><br />
For at kunne give brugerne mulighed&nbsp;afgive samtykke til at biblioteket m&aring; gemme brugerens l&aring;nehistorik (og dermed kunne tilg&aring; listen Tidligere l&aring;n), skal modulet Ding Consent v&aelig;re sl&aring;et til. Biblioteker p&aring; Redakt&oslash;rplanen skal bede DBC sl&aring; modulet til.</p>

<p>N&aring;r User Consent er sl&aring; til, betyder det at:</p>

<p>1. Brugerne kan sige &ldquo;ja&rdquo;, dvs, afgive samtykke, til personalisering inde p&aring; deres brugerprofil. Fortryder de senere, kan &ldquo;Ja&rdquo; &aelig;ndres til &ldquo;Nej&rdquo;, hvorved samtykket tr&aelig;kkes tilbage og l&aring;nehistorikken slettes.<br />
2. Brugere, der endnu ikke har afgivet samtykke, vil af og til blive pr&aelig;senteret for muligheden i en bl&aring; &ldquo;interaktionsboks&rdquo; p&aring; forsiden, s&aring;fremt interaktionen &ldquo;Opbevaring af information om dine tidligere l&aring;n&rdquo; er sl&aring;et til under /admin/config/ding/interaction.</p>

<p>G&Oslash;R DETTE: Under /admin/config/ding/consent skal du s&aelig;tte flueben i Enable Ding User Consent. Herefter skal link inds&aelig;ttes til en side/node hvor brugeren kan l&aelig;se, hvordan deres data bruges. Siden kan fx oprettes med alias&#39;et &quot;samtykke&quot;.</p>

<p>F&oslash;lgende tekst kan inds&aelig;ttes p&aring; siden:</p>

<p><strong>Samtykke til at gemme l&aring;nehistorik</strong></p>

<p><strong>Lov om behandling af personoplysninger</strong><br />
Loven om behandling af personoplysninger kr&aelig;ver, at du giver dit samtykke til, at bibliotekssystemet m&aring; opbevare oplysninger om dit brug af biblioteket og bibliotekets hjemmeside. Data deles ikke med 3. part. Hvis du &oslash;nsker at udnytte de muligheder, som personaliseringsl&oslash;sningen tilbyder, skal du derfor afgive en samtykkeerkl&aelig;ring</p>

<p>Ved at tiltr&aelig;de denne erkl&aelig;ring giver du samtykke til f&oslash;lgende:</p>

<p><strong>Opbevaring af oplysninger om dine l&aring;n og reserveringer</strong><br />
I din l&aring;nerprofil, som du f&aring;r adgang til, n&aring;r du logger ind p&aring; hjemmesiden, f&aring;r du et overblik over, hvilke materialer du har reserveret i &oslash;jeblikket, og hvilke materialer du har hjemme. Som et ekstra tilbud kan biblioteket, hvis du afgiver samtykkeerkl&aelig;ring, tilbyde at opbevare oplysninger om dine tidligere reserveringer og l&aring;n med det form&aring;l at give dig et overblik over dit brug af biblioteket og hjemmesiden. Din l&aring;nerhistorik vil desuden v&aelig;re en af de faktorer, der indg&aring;r i sammens&aelig;tningen af forslag til ny inspiration, som du vil m&oslash;de p&aring; hjemmesiden, n&aring;r du er logget ind.</p>

<p><strong>Udveksling af oplysninger med andre systemer</strong><br />
N&aring;r du anvender tjenester p&aring; eller via bibliotekets hjemmeside, sker der en udveksling af dine personlige oplysninger med andre systemer, som tilbyder biblioteksrelevante materialer. Det drejer sig om dit navn, dit cpr-nummer og det bibliotek du kommer fra. Udvekslingen har til form&aring;l at sikre en entydig identifikation af, hvem du er, samt muligg&oslash;re din anvendelse af tjenesten.</p>

<p>Hvis du har afgivet samtykkeerkl&aelig;ring, vil det i mange tilf&aelig;lde v&aelig;re muligt at overf&oslash;re og dele oplysningerne om din tidligere l&aring;nehistorik med andre bibliotekstjenester, der tilbyder personaliseringsl&oslash;sningen, og p&aring; den m&aring;de udvide dine muligheder for at holde dig ajour med din brug af biblioteksydelser p&aring; tv&aelig;rs af forskellige tjenester.</p>

<p><strong>Deling af personlige data</strong><br />
Personaliseringsl&oslash;sningen giver dig mulighed for at sammens&aelig;tte inspirationslister af indholdselementer fra bibliotekets samlede vifte af tilbud, med udgangspunkt i dine egne data. Du vil f&aring; mulighed for at dele dine personlige data med andre. Det sker ikke per automatik, hvis du afgiver samtykkeerkl&aelig;ring, men du f&aring;r muligheden stillet til r&aring;dighed.</p>

<p><strong>Sikkerhed</strong><br />
Det er afg&oslash;rende, at du som bruger kan f&oslash;le dig tryg ved behandlingen af de personoplysninger, bibliotekets hjemmeside gemmer i forbindelse med din l&aring;nerprofil. Biblioteket overholder naturligvis g&aelig;ldende lovgivning om behandling af personoplysninger, bl.a. ved anvendelse af NemID, WAYF eller digital signatur og avanceret krypteringsteknologi.</p>

<p><strong>Tilbagekaldelse af samtykke</strong><br />
Du kan til enhver tid tilbagekalde din samtykkeerkl&aelig;ring. Tilbagekalder du samtykket kan du ikke genskabe din l&aring;nehistorik. Giver du senere et samtykke igen, vil du kun kunne se l&aring;nehistorikken fra det tidspunkt, hvor du igen har givet samtykke.</p>

<p><em>S&aring;dan skal Ding User consent konfigureres. Husk at oprette siden [BIBLIOTEKSNAVN.DK/samtykke] med den ovenst&aring;ende tekst</em></p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2303/screendump%20ding%20user%20consent%20samtykke.JPG" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="ding-interaction">Ding Interaction</h3>

<p>Interaktionsmodulet Ding Interaction muligg&oslash;r, at biblioteket opretter interaktionsbokse der p&aring; forsiden opfordrer brugeren til at benytte sig af de forskellige muligheder. Som standard er aktiveret en opfordring til at bruge liste-funktionerne. Der er flere forud-definerede interaktioner, som kan sl&aring;s til. Dette g&oslash;res under Indstillinger&gt; Ding&gt; Ding Interaction overview (Sti:/admin/config/ding/interaction)</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2305/Ding%20interaction%20overview.JPG" style="border-width: 2px; border-style: solid;" /></p>

<p><strong>Antal sider</strong> eller <strong>Page count</strong> angiver antallet af sideskift, en bruger skal foretage sig, f&oslash;r interaktionsboksen bliver vist. Det er meningen, at boksene <strong>ikke</strong> skal vises hele tiden, men ind imellem poppe op og minde brugeren om diverse muligheder.</p>

<p>Biblioteket kan selv oprette manuelle interaktioner, som bruges til at henlede borgernes opm&aelig;rksomhed p&aring; forskellige funktioner. Under oversigten over manuelle interaktioner, er der et link til oprettlse af manuelle interaktionsbokse -&gt; /admin/structure/entity-type/ding_type/ding_interaction</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2368/Ding%20interaction%20indstillinger.JPG" style="border-width: 2px; border-style: solid;" /></p>

<p id="obs---specielt-for-fbs-biblioteker"><strong>OBS - Specielt for FBS biblioteker</strong></p>

<p>Det anbefales <strong>ikke</strong> at aktivere andre af standardinteraktionerne, f&oslash;r det bliver muligt for brugere hos FBS-bibliotekerne at gemme l&aring;nehistorikken, da disse interaktioner henviser til, at man kan gemme l&aring;n eller bed&oslash;mme tidligere l&aring;n, hvilket kr&aelig;ver at modulet Ding Consent er aktiveret.</p>

<p>Hvis I er et DDE Libra-bibliotek, men skal overg&aring; til FBS inden for de n&aelig;ste m&aring;neder, anbefaler vi heller ikke at aktivere Ding Consent endnu, da borgerne givetvis vil opleve det som en forringelse, hvis de lige har v&aelig;nnet sig til muligheden for at se deres l&aring;nehistorik og den s&aring; bliver fjernet.</p>

<h3>Opret en manuel interaktionsboks</h3>

<p>Url: /admin/structure/entity-type/ding_type/ding_interaction/add?destination=admin/structure/entity-type/ding_type/ding_interaction</p>

<p>For at interaktionsboksen vises, skal der s&aelig;ttes flueben ved &quot;Aktiveret&quot;. N&aring;r den er aktiveret, kan det styres om den vises for alle &quot;No access check&quot;, kun for dem der er logget p&aring; eller kun for dem der ikke er logget p&aring;.</p>

<p><img alt="" data-rich-file-id="124" src="/system/rich/rich_files/rich_files/000/000/124/original/interaktionsboks_dump1.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h2>Placering af indhold p&aring; forsiden og sektioner</h2>

<h3>Forfremmelse af indhold til forsiden</h3>

<p>Under &quot;Indstillinger -&gt; Ding -&gt; Promote content types to front page&quot; (/admin/config/ding/fe-promote) kan det v&aelig;lges at alle nyheder eller arrangementer som standard forfremmes til forsiden. Ved oprettelse af et nyt arrangement/nyhed kan dette frav&aelig;lges for det enkelte indholdselement under &quot;Udgivelse&quot;. Det er alts&aring; ikke l&aelig;ngere n&oslash;dvendigt for redakt&oslash;rer at f&aring; en administrator til at forefremme deres indhold, s&aring;fremt administrator &eacute;n gang har valgt at indholdstypen er forfremmet som standard.</p>

<p><strong>Oprettelse af sektioner</strong></p>

<ul>
	<li><a href="https://platform.dandigbib.org/projects/ddb-cms/wiki/Ddb-cms-manual_struktur-og-indhold#Opret-en-sektion">Se hvordan du opretter en sektion her</a>.</li>
</ul>

<h3>Panels in place foruds&aelig;tninger</h3>

<p>Panels in Place giver brugeren mulighed for at flytte de enkelte moduler op og ned p&aring; forsiden.</p>

<ul>
	<li>Rolle: For at bruge Panels skal man v&aelig;re logget ind som lokaladmin</li>
</ul>

<h3>Hvordan placerer man et nyt element p&aring; forsiden eller sektioner?</h3>

<ul>
	<li>
	<p>Log ind</p>
	</li>
	<li>
	<p>Klik p&aring; &ldquo;Rediger denne side&rdquo; nederst p&aring; forsiden eller sektionen.</p>
	</li>
</ul>

<p><img alt="" data-rich-file-id="4" src="/system/rich/rich_files/rich_files/000/000/004/original/panels_dump1.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Siden er nu opdelt i kolonner i fuld bredde placeret under hinanden.</p>

<p><img alt="" data-rich-file-id="3" src="/system/rich/rich_files/rich_files/000/000/003/original/panels_dump2.png" style="border-width: 2px; border-style: solid;" /></p>

<ul>
	<li>Klik p&aring; &ldquo;tilf&oslash;j&rdquo;-knappen og v&aelig;lg det modul, du &oslash;nsker at placere p&aring; forsiden.</li>
</ul>

<h3>Ops&aelig;tning af de enkelte moduler</h3>

<h4>1) Popul&aelig;rt (&ldquo;mest popul&aelig;re materialer&rdquo;)</h4>

<h4><img alt="" data-rich-file-id="6" src="/system/rich/rich_files/rich_files/000/000/006/original/panels_dump4.png" style="border-width: 2px; border-style: solid;" /></h4>

<ul>
	<li>Skriv en alternativ titel i feltet &ldquo;tilsides&aelig;t titel&rdquo;. Hvis titlen ikke &aelig;ndres er teksten &ldquo;mest popul&aelig;re materialer&rdquo;</li>
	<li>Klik p&aring; afslut</li>
</ul>

<p><img alt="" data-rich-file-id="8" src="/system/rich/rich_files/rich_files/000/000/008/original/panels_dump5.png" style="border-width: 2px; border-style: solid;" /></p>

<ul>
	<li>Et klik p&aring; papirkurven sletter elementet.</li>
	<li>Klik p&aring; tandhjulet for at &aelig;ndre titel p&aring; elementet</li>
</ul>

<h4>2) Biblioteket foresl&aring;r materialer til dig (Ding Serendipitet)</h4>

<ul>
	<li>
	<p>V&aelig;lg evt. ny titel</p>
	</li>
	<li>
	<p>V&aelig;lg visningsformatet &ldquo;teaser&rdquo;</p>
	</li>
	<li>V&aelig;lg hvor mange materialer der skal vises i karussellen (min. og max.)</li>
</ul>

<p><img alt="" data-rich-file-id="7" src="/system/rich/rich_files/rich_files/000/000/007/original/panels_dump6.png" style="border-width: 2px; border-style: solid;" /></p>

<ul>
	<li>Mark&eacute;r &ldquo;ting_object&rdquo; og &ldquo;frontpage&rdquo;</li>
	<li>Klik p&aring; afslut</li>
</ul>

<p><img alt="" data-rich-file-id="9" src="/system/rich/rich_files/rich_files/000/000/009/original/panels_dump7.png" style="border-width: 2px; border-style: solid;" /></p>

<p><img alt="" data-rich-file-id="12" src="/system/rich/rich_files/rich_files/000/000/012/original/panels_dump8.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Note: Indholdet i karussellen bestemmes i /admin/config/ding/serendipity/key_overview, /admin/config/ding/serendipity /admin/config/ding/frontend</p>

<h4>3) Tab-roll (&ldquo;Ting frontpage tab-roll&rdquo;)</h4>

<p>Note: For at indholdet skal vises i karussellen kr&aelig;ves det, at tab-rollen er udgivet.</p>

<h4>4) Forsidekarussel</h4>

<p>Der kan oprettes flere forsidekarruseller og en forsidekarrusel kan have flere faner med materialelister. Se et eksempel p&aring; en forsidekarrusel herunder der har tre faner med materialelisterne: Ny sk&oslash;nlitteratur p&aring; biblioteket, Unge og Yndlingsb&oslash;ger.</p>

<p><img alt="" data-rich-file-id="740" src="/system/rich/rich_files/rich_files/000/000/740/original/1karrusel.jpg" /></p>

<p>1. G&aring; til forsiden eller sektionsforside. Tryk p&aring; &rsquo;Rediger denne side&rsquo; i bunden.</p>

<p><img alt="" data-rich-file-id="741" src="/system/rich/rich_files/rich_files/000/000/741/original/2rediger.jpg" /></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif">2. Tryk p&aring; &rsquo;Add&rsquo;.</span></span></span></span></p>

<p style="margin:0cm 0cm 10pt"><img alt="" data-rich-file-id="742" src="/system/rich/rich_files/rich_files/000/000/742/original/3add.jpg" /></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif">3. Tryk p&aring; &rsquo;Forsidekarrusel&rsquo; i dropdown.</span></span></span></span></p>

<p style="margin:0cm 0cm 10pt"><img alt="" data-rich-file-id="743" src="/system/rich/rich_files/rich_files/000/000/743/original/4tilf%C3%B8j.jpg" /></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif"><span style="font-size:9.0pt"><span style="font-family:&quot;Helvetica&quot;,&quot;sans-serif&quot;"><span style="color:#333333">4. Tryk p&aring; &rsquo;Add one more&rsquo; for at tilf&oslash;je faner med materialelister.</span></span></span></span></span></span></span></p>

<p style="margin:0cm 0cm 10pt"><img alt="" data-rich-file-id="744" src="/system/rich/rich_files/rich_files/000/000/744/original/5addmore.jpg" /></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif"><span style="font-size:9.0pt"><span style="font-family:&quot;Helvetica&quot;,&quot;sans-serif&quot;"><span style="color:#333333">5. Lav din fane.</span></span></span></span></span></span></span></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif"><span style="font-size:9.0pt"><span style="font-family:&quot;Helvetica&quot;,&quot;sans-serif&quot;"><span style="color:#333333">Du kan sortere materialerne efter fx udgivelses&aring;r, forfatter, titel etc. Og du kan afgr&aelig;nse materialerne i listen til kun at v&aelig;re materialer der er hjemme.</span></span></span></span></span></span></span></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif"><span style="font-size:9.0pt"><span style="font-family:&quot;Helvetica&quot;,&quot;sans-serif&quot;"><span style="color:#333333">Det er en god ide at teste din s&oslash;gning i s&oslash;gefeltet, inden du g&aring;r i gang med at redigere karrusellen. S&oslash;rg for ikke at lave for store s&oslash;gninger, da det vil g&oslash;re forsiden langsom.</span></span></span></span></span></span></span></p>

<p style="margin:0cm 0cm 10pt"><img alt="" data-rich-file-id="745" src="/system/rich/rich_files/rich_files/000/000/745/original/6fane.jpg" /></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif"><span style="font-size:9.0pt"><span style="font-family:&quot;Helvetica&quot;,&quot;sans-serif&quot;"><span style="color:#333333">6. Tryk p&aring; Afslut og derefter Gem.</span></span></span></span></span></span></span></p>

<p style="margin:0cm 0cm 10pt"><span style="font-size:11pt"><span style="background:white"><span style="line-height:normal"><span style="font-family:Calibri,sans-serif"><span style="font-size:9.0pt"><span style="font-family:&quot;Helvetica&quot;,&quot;sans-serif&quot;"><span style="color:#333333">Afh&aelig;ngig af ops&aelig;tningen af cachen, kan der g&aring; et stykke tid f&oslash;r den nye karrusel vises for l&aring;nerne. </span></span></span></span></span></span></span></p>

<h4>5) Ding Interaction panel</h4>

<ul>
	<li>
	<p>V&aelig;lg evt. ny titel</p>
	</li>
	<li>
	<p>V&aelig;lg hvor tit boxen(e) skal vises</p>
	</li>
	<li>Klik afslut</li>
</ul>

<p><img alt="" data-rich-file-id="10" src="/system/rich/rich_files/rich_files/000/000/010/original/panels_dump9.png" style="border-width: 2px; border-style: solid;" /></p>

<p><img alt="" data-rich-file-id="11" src="/system/rich/rich_files/rich_files/000/000/011/original/panels_dump10.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Note. Indholdet bestemmes under /admin/config/ding/interaction</p>

<h4>6) Temasider (&ldquo;View: Ding Group temapages&rdquo;)</h4>

<ul>
	<li>
	<p>V&aelig;lg evt. ny titel</p>
	</li>
	<li>
	<p>Klik afslut Note: For at indholdet skal vises i karussellen kr&aelig;ves det, at tab-rollen er udgivet.</p>
	</li>
</ul>

<h4>7) Kampagner (&ldquo;Relevant campaigns&rdquo;)</h4>

<ul>
	<li>
	<p>V&aelig;lg evt. ny titel</p>
	</li>
	<li>
	<p>V&aelig;lg antal kampagner p&aring; forsiden under &ldquo;Campaign Count&rdquo;</p>
	</li>
	<li>Klik afslut</li>
</ul>

<p><img alt="" data-rich-file-id="13" src="/system/rich/rich_files/rich_files/000/000/013/original/panels_dump11.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Note: Hvilke kampagner der skal vises p&aring; forsiden, bestemmes i ops&aelig;tningen af den enkelte kampagne. Under &ldquo;campaign rules&rdquo; v&aelig;lges typen: path med v&aelig;rdien:</p>

<p><img alt="" data-rich-file-id="15" src="/system/rich/rich_files/rich_files/000/000/015/original/panels_dump12.png" style="border-width: 2px; border-style: solid;" /></p>

<h4>8) Nyheder (&ldquo;View: Ding news: news list frontpage&rdquo;)</h4>

<ul>
	<li>
	<p>V&aelig;lg evt. ny titel</p>
	</li>
	<li>
	<p>Klik afslut Note: For at indholdet skal vises i karussellen skal det v&aelig;re udgivet og forfremmet til forsiden</p>
	</li>
</ul>

<h4>9) Begivenheder (&ldquo;View: Ding events: events list frontpage&rdquo;)</h4>

<ul>
	<li>
	<p>V&aelig;lg evt. ny titel</p>
	</li>
	<li>
	<p>Klik afslut Note: For at indholdet skal vises i karussellen skal det v&aelig;re udgivet og forfremmet til forsiden</p>
	</li>
</ul>

<h4>10) &Aring;bningstider (&ldquo;all openings hours&rdquo;)</h4>

<p>Note: Indholdet redigeres i indholdstypen bibliotek</p>

<h4>11) Nodelist</h4>

<p><strong>Tilf&oslash;j nodelist</strong></p>

<ol>
	<li>Klik p&aring; &quot;Rediger denne side&quot;</li>
	<li>Tilf&oslash;j (&rdquo;add&rdquo;) et panel i &rdquo;panels in place&rdquo; (hvis menuen d&aelig;kker over valgmulighederne, kan du trykke add l&aelig;ngere nede p&aring; siden under fx secondary content).</li>
	<li>V&aelig;lg &rdquo;nodelist&rdquo; i oversigten over moduler
	<ul>
		<li>S&aelig;t flueben med &rdquo;override title&rdquo; for at kunne give nodelisten sit eget navn</li>
		<li>Nodelisten er sat til at kunne indeholde b&aring;de nyheder, arrangementer og sider.&nbsp;</li>
		<li>For at opn&aring; det bedste resultat anbefales det ikke at blande indholdstyperne, men oprette s&aelig;rskilte nodelister for nyheder, arrangementer og sider.</li>
	</ul>
	</li>
	<li>Under &rdquo;List type&rdquo; v&aelig;lges, hvordan artiklernes listebillede skal vises.
	<ul>
		<li>&quot;Carousel&quot; viser indhold lidt som tabroll p&aring; forsiden, men med pile til at bladre mellem indholdet.</li>
		<li>&quot;Rolltab&quot; viser indhold ligesom tabroll p&aring; forsiden</li>
		<li>&rdquo;Promoted nodes&rdquo; viser billeder i 3 kolonner med skiftevis stort og medium forsidebillede.</li>
		<li>&rdquo;Nodes in blocks&rdquo; viser artiklerne i 3 kolonner<span style="display: none;">&nbsp;</span></li>
	</ul>
	</li>
	<li>V&aelig;lg indhold
	<ul>
		<li>Alt indhold. Som udgangspunkt vises alt publiceret indhold (&rdquo;all content&rdquo;) begr&aelig;nset til max 4 artikler (&rdquo;item limit&rdquo;). I dropdownen kan man v&aelig;lge at vise op til 100 artikler.&nbsp;</li>
		<li>S&aelig;ttes flueben ved &rdquo;show upcoming events only&rdquo; vises kun fremtidige arrangementer</li>
		<li><img alt="" data-rich-file-id="750" src="/system/rich/rich_files/rich_files/000/000/750/original/01content.jpg" /></li>
	</ul>
	</li>
</ol>

<p><strong>Indhold i nodelist</strong></p>

<ol>
	<li>Tilpasset indhold (custom)
	<ul>
		<li>&Oslash;nsker man at bestemme pr&aelig;cis hvilke artikler der skal vises i nodelisten, klik p&aring; &rdquo;custom content&rdquo; (tilpasset indhold).</li>
		<li>Under &rdquo;selected content&rdquo; s&oslash;ger man de enkelte artikler frem.&nbsp;</li>
		<li>Artiklerne skal v&aelig;re publiceret for at kunne blive frems&oslash;gt under &rdquo;selected content&rdquo;</li>
		<li><img alt="" data-rich-file-id="751" src="/system/rich/rich_files/rich_files/000/000/751/original/02custom.png" /></li>
		<li>Klik p&aring; &rdquo;Add content&rdquo; Man kan tilf&oslash;je lige som mange individuelle artikler, som man &oslash;nsker.</li>
	</ul>
	</li>
	<li>Dynamisk indhold
	<ul>
		<li>&Oslash;nsker man at filtre de viste artikler udfra taxonomier, klik p&aring; &rdquo;dynamic content&rdquo;.&nbsp;</li>
		<li>Den dynamiske filtrering fungerer bedst hvis man ikke kombinere de enkelte indholdstyper (nyheder, arrangementer, sider)</li>
		<li>Dynamisk indhold og tilpasset indhold (custom) kan kombineres i samme nodeliste</li>
	</ul>
	</li>
	<li>Dynamiske nyheder
	<ul>
		<li>I feltet &rdquo;field&rdquo; v&aelig;lger man hvilket parameter, nyhederne kan filtreres efter:</li>
		<li>Kategorier (&rdquo;category&rdquo;), tilknyttede emneord (&rdquo;tags&rdquo;) eller bibliotek (&rdquo;library&rdquo;). Det er ogs&aring; muligt at filtre indholdet efter temaer (&rdquo;groups&rdquo;)<br />
		Man &nbsp;kan oprette lige s&aring; mange filtre, man &oslash;nsker.</li>
		<li><img alt="" data-rich-file-id="752" src="/system/rich/rich_files/rich_files/000/000/752/original/03dynamisknyhed.png" /></li>
		<li>Et eksempel p&aring; en nodeliste, som filtrerer nyheder efter kategori (anbefalinger), tag (b&oslash;rnelitteratur) og bibliotek (lokalbibliotek):&nbsp;</li>
		<li><img alt="" data-rich-file-id="753" src="/system/rich/rich_files/rich_files/000/000/753/original/04eksnyhed.png" /></li>
	</ul>
	</li>
	<li>Dynamiske arrangementer
	<ul>
		<li>I feltet &rdquo;field&rdquo; v&aelig;lger man hvilket parameter, arrangementer kan filtreres efter:</li>
		<li>Arrangementskategorier (&rdquo;category&rdquo;), tilknyttede emneord (&rdquo;tags&rdquo;), m&aring;lgrupper (&rdquo;target&rdquo;) eller bibliotek (&rdquo;library&rdquo;). Det er ogs&aring; muligt at filtre indholdet efter arrang&oslash;r (&rdquo;organizer&rdquo;) og temaer (&rdquo;groups&rdquo;)</li>
		<li>Et eksempel p&aring; en nodeliste som kombinerer arrangementer med m&aring;lgruppen (for b&oslash;rn) og tilpasset indhold (arrangementet: m&oslash;d forfatteren: Elisabeth Egholm):</li>
		<li><img alt="" data-rich-file-id="754" src="/system/rich/rich_files/rich_files/000/000/754/original/05dynamiskarr.png" /></li>
	</ul>
	</li>
	<li>Dynamiske sider
	<ul>
		<li>I feltet &rdquo;field&rdquo; v&aelig;lger man hvilket parameter, sider kan filtreres efter: Tags, bibliotek og temaer (&rdquo;groups&rdquo;)</li>
		<li>Et eksempel p&aring; en nodeliste med sider som kombinerer tilpasset indhold (om at bruge lister) med sider, som er tagget med &rdquo;kager&rdquo;</li>
		<li><img alt="" data-rich-file-id="755" src="/system/rich/rich_files/rich_files/000/000/755/original/06dynasider.png" /></li>
	</ul>
	</li>
</ol>

<p><strong>Sortering af indhold</strong></p>

<ol>
	<li>Sortering af indhold
	<ul>
		<li>Indholdet i nodelisten kan sorteres efter oprettelsesdato, titel og om indholdet er sat til at v&aelig;re kl&aelig;brigt p&aring; forsiden.&nbsp;</li>
		<li>Under additional links kan man linke til eksterne eller interne sider eller til andre sektionsforsider. Linkes skal indholde b&aring;de tekst og link</li>
		<li><img alt="" data-rich-file-id="756" src="/system/rich/rich_files/rich_files/000/000/756/original/07sotering.png" /></li>
	</ul>
	</li>
</ol>

<p><strong>Gem og afslut</strong></p>

<ol>
	<li>Gem nodelisten.
	<ul>
		<li>N&aring;r ops&aelig;tningen af nodelisten er f&aelig;rdig klik p&aring; &rdquo;finish)</li>
		<li><img alt="" data-rich-file-id="757" src="/system/rich/rich_files/rich_files/000/000/757/original/08gem.png" /></li>
		<li>Til slut klikkes p&aring; &rdquo;save&rdquo; for at gemme &aelig;ndringerne i hele panels in place</li>
		<li><img alt="" data-rich-file-id="758" src="/system/rich/rich_files/rich_files/000/000/758/original/09save.png" /></li>
	</ul>
	</li>
</ol>

<p>&nbsp;</p>

<h3>Flytning af modulerne</h3>

<ul>
	<li>
	<p>Log ind som lokaladmin</p>
	</li>
	<li>
	<p>Klik p&aring; &ldquo;Rediger denne side&rdquo;</p>
	</li>
	<li>Klik p&aring; ikonet yderst til h&oslash;jre</li>
</ul>

<p><img alt="" data-rich-file-id="14" src="/system/rich/rich_files/rich_files/000/000/014/original/panels_dump13.png" style="border-width: 2px; border-style: solid;" /></p>

<ul>
	<li>Hold musetasten nede og bev&aelig;g ikonet op eller ned</li>
	<li>N&aring;r modulet forlader sin oprindelige plads vises en horisontal gul stribe</li>
</ul>

<p><img alt="" data-rich-file-id="16" src="/system/rich/rich_files/rich_files/000/000/016/original/panels_dump14.png" style="border-width: 2px; border-style: solid;" /></p>

<ul>
	<li>Bev&aelig;g musen op eller ned indtil der igen viser sig en gul stribe</li>
	<li>Slip musen</li>
</ul>

<p><img alt="" data-rich-file-id="17" src="/system/rich/rich_files/rich_files/000/000/017/original/panels_dump15.png" style="border-width: 2px; border-style: solid;" /></p>

<ul>
	<li>Klik p&aring; &ldquo;gem&rdquo; hver gang et modul flyttes</li>
</ul>

<h3>&Aring;bningstider</h3>

<p>P&aring; forsiden kan der v&aelig;re to veje til &aring;bningstiderne - den ene er et bredt panel, som vises under sidens indhold, og den anden er egentlig to veje til samme indhold, nemlig enten linket til Biblioteker i hovedmenuen eller knappen &Aring;bningstider &oslash;verst til h&oslash;jre p&aring; siden.</p>

<p><img alt="" data-rich-file-id="34" src="/system/rich/rich_files/rich_files/000/000/034/original/opening-hours_dump4.PNG" style="border-width: 2px; border-style: solid;" /></p>

<p><img alt="" data-rich-file-id="31" src="/system/rich/rich_files/rich_files/000/000/031/original/opening-hours_dump2.PNG" style="border-width: 2px; border-style: solid;" /></p>

<p>Knappen kan deaktiveres eller aktiveres under Struktur -&gt; Menuer -&gt; Topbar menu, hvor hakket under Aktiveret fjernes i r&aelig;kken med Opening hours.</p>

<p><img alt="" data-rich-file-id="33" src="/system/rich/rich_files/rich_files/000/000/033/original/opening-hours_dump3.PNG" style="border-width: 2px; border-style: solid;" /></p>

<p>For at f&aring; vist &aring;bningstider p&aring; forsiden i vandret panel, skal man under Indstillinger -&gt; Ding -&gt; Ding DDBasic opening hours s&aelig;tte hak i boksen &quot;Show opening hours on frontpage&quot;.</p>

<p><img alt="" data-rich-file-id="32" src="/system/rich/rich_files/rich_files/000/000/032/original/opening-hours_dump1.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h2>Kontaktinformation</h2>

<h3 id="adresseoplysninger-i-footerensidefoden">Adresseoplysninger i footeren/sidefoden</h3>

<p>I footeren er det muligt at inds&aelig;tte adresseoplysninger. For at &aelig;ndre adresseoplysninger foruds&aelig;ttes at din bruger har administratorrettigheder.</p>

<p><strong>Fremgangsm&aring;de: &AElig;ndre adresseoplysninger i footeren.</strong></p>

<ol>
	<li>G&aring; til &ldquo;Struktur -&gt; Blokke -&gt; Footer adresse (klik p&aring; &ldquo;indstil&rdquo; yderst til h&oslash;jre) (Sti: admin/structure/block/manage/block/1/configure).</li>
	<li>I feltet &ldquo;Indhold&rdquo; indtastes den &oslash;nskede adresse.</li>
	<li>Tryk p&aring; knappen &ldquo;Gem blok&rdquo; nederst p&aring; siden.</li>
</ol>

<h3>Kontaktformular</h3>

<p>DDB CMS tilbyder som udgangspunkt en kontaktformular, der findes p&aring; (Sti: https://bibliotekets-hjemmesideadresse.dk/contact). Kontaktformularen indeholder fem hovedfelter:</p>

<ul>
	<li>Navn</li>
	<li>Din e-mail-adresse</li>
	<li>Emne</li>
	<li>Meddelelse</li>
	<li>Kategori: Dropdown-feltet &ldquo;kategori&rdquo; indeholder kategorier til pr&aelig;cisering af form&aring;let med henvendelsen f.eks. &ldquo;Aflevering&rdquo; og &ldquo;Fornyelse af materiale&rdquo;. Det er muligt at redigere og tilf&oslash;je kategorier p&aring; f&oslash;lgende m&aring;de:</li>
</ul>

<p>Fremgangsm&aring;de: Tilf&oslash;j kategori:</p>

<ol>
	<li>&Aring;bn &ldquo;Struktur -&gt; Kontaktformular&rdquo; (Sti: https://bibliotekets-hjemmesideadresse.dk/admin/structure/contact)</li>
	<li>Klik p&aring; &ldquo;+ Tilf&oslash;j kategori&rdquo; i toppen af siden.</li>
	<li>Udfyld de forskellige relevante felter f.eks. navngiv kategorien, udfyld modtageradresse og skriv evt. autosvar, der sendes n&aring;r henvendelser modtages p&aring; den specifikke kategori.</li>
	<li>Klik p&aring; knappen &ldquo;Gem&rdquo;.</li>
	<li>Tjek at kategorien er tilg&aelig;ngelig i dropdown-menuen &ldquo;Kategori&rdquo; p&aring; kontaktformularen (Sti: https://bibliotekets-hjemmesideadresse.dk/contact).</li>
</ol>

<h2 id="webforms-webformularer">Webforms / webformularer</h2>

<p>Webformularer kan oprettes p&aring; 2 m&aring;der:<br />
a) Sammen med indholdstyperne nyheder, arrangementer og sider<br />
b) Som en selvst&aelig;ndig indholdstype</p>

<h3 id="webformularer-tilknyttet-en-nyhed-event-eller-statisk-side">Webformularer tilknyttet en nyhed, event eller statisk side</h3>

<p>Opret en Nyhed<br />
Gem nyheden<br />
Klik p&aring; rediger<br />
V&aelig;lg fanebladet Webform</p>

<p><img alt="" data-rich-file-id="35" src="/system/rich/rich_files/rich_files/000/000/035/original/webforms_dump1.png" style="border-width: 2px; border-style: solid;" /></p>

<p><img alt="" data-rich-file-id="36" src="/system/rich/rich_files/rich_files/000/000/036/original/webforms_dump2.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="form-components">Form Components</h4>

<p>Opret elementer i formularen<br />
Tilf&oslash;j navn p&aring; feltet, v&aelig;lg type (tekstfelt, tekstomr&aring;de, e-mail, dropdown osv.)<br />
S&aelig;t flueben hvis feltet skal udfyldes af brugeren<br />
Klik tilf&oslash;j</p>

<p><img alt="" data-rich-file-id="37" src="/system/rich/rich_files/rich_files/000/000/037/original/webforms_dump3.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Skal der ikke opstilles s&aelig;rlige betingelser for dette felt, klik &ldquo;save component&rdquo;.</p>

<p><img alt="" data-rich-file-id="38" src="/system/rich/rich_files/rich_files/000/000/038/original/webforms_dump4.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Tilf&oslash;jer man et e-mail-felt til formularen er det vigtigt at s&aelig;tte flueben ved valideringen af den afsendt mailadresse</p>

<p><img alt="" data-rich-file-id="39" src="/system/rich/rich_files/rich_files/000/000/039/original/webforms_dump5.png" style="border-width: 2px; border-style: solid;" /></p>

<p>&Oslash;nsker man et drop down felt v&aelig;lges typen &ldquo;Select options&rdquo;.</p>

<p><img alt="" data-rich-file-id="40" src="/system/rich/rich_files/rich_files/000/000/040/original/webforms_dump6.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Tilf&oslash;j en titel p&aring; feltet og skriv de enkelte valgmuligheder brugeren skal pr&aelig;senteres for.<br />
Afslut med &ldquo;save component&rdquo;</p>

<p><img alt="" data-rich-file-id="41" src="/system/rich/rich_files/rich_files/000/000/041/original/webforms_dump7.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Oversigt over formular med titel, type, obligatoriske- og valgfri felter</p>

<p><img alt="" data-rich-file-id="42" src="/system/rich/rich_files/rich_files/000/000/042/original/webforms_dump8.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="conditionals">Conditionals</h4>

<p>I fanebladet &ldquo;Conditionals&rdquo; kan du ops&aelig;tte betingelser for, hvordan input i &eacute;t af felter, kan p&aring;virke visningen af andre felter i formularen</p>

<p><img alt="" data-rich-file-id="43" src="/system/rich/rich_files/rich_files/000/000/043/original/webforms_dump9.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Et eksempel - hvis emnefeltet ikke indeholder Borgerservice, vil e-mail feltet ikke blive vist for brugeren.</p>

<p><img alt="" data-rich-file-id="44" src="/system/rich/rich_files/rich_files/000/000/044/original/webforms_dump10.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="e-mails">E-mails</h4>

<p>Under fanebladet E-mails v&aelig;lges modtageren af webformularen.</p>

<p><img alt="" data-rich-file-id="45" src="/system/rich/rich_files/rich_files/000/000/045/original/webforms_dump11.png" style="border-width: 2px; border-style: solid;" /></p>

<p><img alt="" data-rich-file-id="46" src="/system/rich/rich_files/rich_files/000/000/046/original/webforms_dump12.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="form-settings">Form settings</h4>

<p><img alt="" data-rich-file-id="47" src="/system/rich/rich_files/rich_files/000/000/047/original/webforms_dump13.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Under Form settings kan man komponere en tekst der bekr&aelig;fter modtagelsen af formularen. Det kan enten v&aelig;re ren tekst eller ved at redirecte brugeren til en anden side</p>

<p><img alt="" data-rich-file-id="48" src="/system/rich/rich_files/rich_files/000/000/048/original/webforms_dump14.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Under Form settings kan man ogs&aring; begr&aelig;nse antallet af formularer, som den enkelte bruger kan sende.</p>

<p><img alt="" data-rich-file-id="49" src="/system/rich/rich_files/rich_files/000/000/049/original/webforms_dump15.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="afslutning-opsætningen-og-visning-af-formular">Afslutning ops&aelig;tningen og visning af formular</h4>

<p>Klik p&aring; &ldquo;gem indstillinger&rdquo;, n&aring;r ops&aelig;tningen af formularen er afsluttet<br />
Klik p&aring; vis for at se, hvordan nyheden og den tilknyttede formular ser ud</p>

<p><img alt="" data-rich-file-id="50" src="/system/rich/rich_files/rich_files/000/000/050/original/webforms_dump16.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="statistik">Statistik</h4>

<p>Under fanebladet Resultater finder man statistik over inputtet fra formularen</p>

<p><img alt="" data-rich-file-id="51" src="/system/rich/rich_files/rich_files/000/000/051/original/webforms_dump17.png" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="webformularer-som-en-selvstændig-indholdstype">Webformularer som en selvst&aelig;ndig indholdstype</h3>

<p>Klik p&aring; tilf&oslash;j indhold<br />
V&aelig;lg Webform<br />
Skriv Titel<br />
S&aelig;t flueben ved Tilbyder et menu-link, hvis formularen skal forankres i menustrukturen (hovedmenu eller sekund&aelig;r menu)<br />
Klik p&aring; Gem</p>

<p><img alt="" data-rich-file-id="52" src="/system/rich/rich_files/rich_files/000/000/052/original/webforms_dump18.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Forts&aelig;t ops&aelig;tningen af formularer i afsnittet link til pkt. a)</p>

<h2 id="adresseoplysninger-i-footerensidefoden">Bibliotekssystemet FBS</h2>

<h3 id="pin-kode-skift-længde-brugernes-pin-kode">Pin-kode: Skift l&aelig;ngde brugernes pin-kode</h3>

<p>Kravet til l&aelig;ngden af l&aring;nernes pin-koden kan &aelig;ndres i DDB CMS . Som udgangspunkt er l&aelig;ngden fire karakterer, men der kan v&aelig;lges fra fire til seks karakterer.</p>

<h3 id="ændring-af-længden-af-brugernes-pin-kode.">&AElig;ndring af l&aelig;ngden af brugernes pin-kode.</h3>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Kontoindstillinger&rdquo; (Sti: admin/config/people/accounts).</li>
	<li>Under &ldquo;Pin code length&rdquo; v&aelig;lges mellem 4, 5 eller 6 karakterer.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h3>Slet inaktive providerbrugere</h3>

<p>&Aring;ben &ldquo;Indstillinger -&gt; Ding -&gt; Ding provider&rdquo; (Sti: /admin/config/ding/provider)</p>

<p>Nederst p&aring; siden vises f&oslash;lgende valgmuligheder:</p>

<p><img alt="" data-rich-file-id="229" src="/system/rich/rich_files/rich_files/000/000/229/original/2017-11-28%2010_27_45-Ding%20provider%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h3>&quot;Opret bruger&quot; og &quot;Log ind med NemID&quot;</h3>

<p>&ldquo;Log ind med NemID&rdquo; giver brugerne mulighed for at logge sig ind i DDB CMS med NemID, som et alternativ til den traditionelle log ind med CPR-nummer og pin-kode.</p>

<p>&quot;Opret bruger&quot; giver mulighed for at en bruger kan oprette en brugerprofil uden at skulle m&oslash;de op p&aring; det lokale folkebibliotek. Dermed kan man ogs&aring; oprette sig som bruger udenfor bibliotekets &aring;bningstid og f&aring; adgang til licensbelagte e-ressourcer mv.</p>

<p>L&aring;nerne f&aring;r adgang til:</p>

<ol>
	<li>&ldquo;Log ind med NemID&rdquo;</li>
	<li>&quot;Opret bruger&quot;</li>
</ol>

<p>Funktionerne findes ved at trykke p&aring; fanebladet &quot;Log ind&quot;, hvor de vises lige under &quot;Log ind-knappen&quot;.<img alt="" src="http://platform.dandigbib.org/attachments/download/2733/NemID.png" /></p>

<p>&ldquo;Log ind med NemID&rdquo; eller &quot;Opret bruger&quot; foruds&aelig;tter:</p>

<ol>
	<li>aktivering af moduler og konfiguration af DDB CMS.</li>
	<li>opkobling til Serviceplatformen for automatisk tildeling af l&aring;nerkategori<br />
	&nbsp;</li>
</ol>

<h4>Aktivering af &ldquo;Log ind med NemID&rdquo; og &quot;Opret bruger&quot;:</h4>

<ol>
	<li>Redakt&oslash;rbiblioteker: Opret en sag hos DBC kundeservice: https://kundeservice.dbc.dk/ og bed om aktivering af &ldquo;Log ind med NemID&rdquo; og evt. &quot;Opret bruger med NemID&quot;.</li>
	<li>Webmaster og programm&oslash;rbiblioteker: Aktiv&eacute;r modulet &ldquo;Ding gatewayf&rdquo; under /admin/modules. S&oslash;rg endvidere for at deaktivere modulet &ldquo;Ding Wayf&rdquo; (modulet skal ikke l&aelig;ngere anvendes)</li>
</ol>

<p><strong>Redakt&oslash;rbiblioteker</strong> kan tage de nye funktioner i brug, n&aring;r DBC giver besked om at modulerne er aktiveret og konfigureret.</p>

<p><strong>Webmaster- og Programm&oslash;rbiblioteker</strong> skal selv aktivere modulerne og konfigurere dem, n&aring;r de f&aring;r besked af DBC om at superpinkoden er indsat: Aktiv&eacute;r modulet &ldquo;Ding gatewayf&rdquo; under /admin/modules. S&oslash;rg endvidere for atdeaktivere modulet &ldquo;Ding Wayf&rdquo; (modulet skal ikke l&aelig;ngere anvendes). Konfiguration af modulerne: se fremgangsm&aring;den herunder.</p>

<h4 id="konfigurering-af-log-ind-med-nemid">Konfigurering af &rdquo;Log ind med NemID&rdquo;</h4>

<p>Foruds&aelig;tter at processen under &quot;Aktivering for FBS biblioteker&quot;&nbsp;er gennemf&oslash;rt.</p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Gateway WAYF (Under afsnittet &ldquo;DING&rdquo;)&ldquo; (Sti: /admin/config/ding/gatewayf ).</li>
	<li>Check at feltet &quot;Gateway WAYF URL&quot; som standard er udfyldt med https://bibliotek.dk/gatewayf/gatewayf.php</li>
	<li>Test at &ldquo;Log ind med NemID&rdquo; fungerer p&aring; sitet.</li>
</ol>

<h4 id="konfigurering-af-opret-bruger">Konfigurering af &rdquo;Opret bruger&rdquo;</h4>

<p>Foruds&aelig;tter at processen under &quot;Aktivering for FBS biblioteker&quot; er gennemf&oslash;rt.</p>

<ol>
	<li>Aktiv&eacute;r modulet &ldquo;Ding gatewayf registration&rdquo; under /admin/modules. V&aelig;r opm&aelig;rksom p&aring; at &ldquo;Ding gatewayf registration&quot; kr&aelig;ver at &ldquo;Ding gatewayf&rdquo; er aktiveret.</li>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Gateway WAYF (Under afsnittet &ldquo;DING&rdquo;)&ldquo; (Sti: /admin/config/ding/gatewayf ).</li>
	<li>Feltet &quot;Age limit&quot; under &quot;NY BRUGER - NEMID&quot; er som standard udfyldt med &quot;18&quot;. Denne indstilling b&oslash;r som udgangspunkt ikke &aelig;ndres. (Unge i alderen 15-17 &aring;r kan godt have en NemiD, men n&aring;r man er under 18 &aring;r er man ikke myndig, og oprettelsesflowet underst&oslash;tter ikke at for&aelig;ldre/v&aelig;rge f&oslash;rst skal godkende en brugeroprettelse for deres umyndig(e) barn/b&oslash;rn)</li>
	<li>Sektionen &quot;INFORMATION PAGE&quot; indeholder den tekst, der vises til brugeren, n&aring;r han/hun klikker p&aring; &quot;Opret bruger via NemID. Standardteksten lyder:<br />
	<em>Her kan du oprette dig som bruger ved biblioteket.</em><br />
	<em>For at oprette dig skal du bruge dit NemID, og du skal v&aelig;re:</em><br />
	* <em>fyldt 18 &aring;r</em><br />
	<em>godkende at have l&aelig;st og accepteret bibliotekets <strong>reglement</strong> og takster</em><br />
	<em>Du kan selvf&oslash;lgelig stadig oprette dig som bruger ved personlig henvendelse.</em></li>
	<li>Inds&aelig;t SELV et link i teksten til den side p&aring; sitet, der indeholder bibliotekets reglement.</li>
	<li>Sektionen &quot;ACCEPTANCE PAGE&quot; indeholder den tekst, der vises til brugeren ud for &quot;Accept&eacute;r&quot; checkboksen i oprettelsesforl&oslash;bet. Som standard er det: <em>Jeg accepterer bibliotekets reglement</em></li>
	<li>Sektionen &quot;SUCCESSFUL REGISTRATION PAGE&quot; indeholder den tekst, der vises til brugeren n&aring;r han/hun er oprettet. Som standard er det: <em>Du er nu oprettet som bruger.</em></li>
	<li>Test at &ldquo;Opret bruger&rdquo; fungerer p&aring; sitet.</li>
</ol>

<ol>
</ol>

<h3 id="rediger-tekst-i-grænsefladen-gebyr-for-sms">Rediger tekst i gr&aelig;nsefladen &ldquo;Gebyr for SMS&rdquo;</h3>

<p>L&aring;nerprofilen i DDB CMS indeholder et felt, hvor det er muligt at indtaste et mobilnummer, som bl.a. kan bruges til at sende l&aring;neren SMS notifikationer ang. materiale til afhentning og lignende. Under feltet vises der som udgangspunkt f&oslash;lgende hj&aelig;lpetekst: &ldquo;V&aelig;r opm&aelig;rksom p&aring;, at der er et gebyr p&aring; SMS&rdquo;. Det er muligt at redigere eller helt fjerne teksten. Sidstn&aelig;vnte er naturligvis relevant, hvis man ikke har gebyr for SMS-notifikationer.</p>

<p>S&aring;dan g&oslash;r du:</p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Kontoindstillinger&rdquo; (Sti: admin/config/people/accounts)</li>
	<li>Rediger teksten (evt. fjern teksten helt) i feltet &ldquo;Fee for SMS&rdquo;.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<p>Bem&aelig;rk at de &oslash;vrige felter og fanebladene &ldquo;H&aring;ndt&eacute;r felter&rdquo; og &ldquo;H&aring;ndt&eacute;r visning&rdquo; ikke er tilt&aelig;nkt at skulle bruges, da det kan have uforudsete konsekvenser for systemet.</p>

<h2 id="administration">Betaling af mellemv&aelig;rende med&nbsp;DIBS betalingsservice</h2>

<p>N&aring;r DIBS-integrationen i DDB CMS er konfigureret, kan brugerne betale deres mellemv&aelig;render/b&oslash;der via hjemmesiden. Personalet har desuden mulighed for at kontrollere hvilke transaktionerne, der er foretaget under (URL: admin/config/payment/ding_dibs/reports).</p>

<p>Integrationen foruds&aelig;tter:</p>

<ul>
	<li>SSL certifikat.</li>
	<li>Aftale med DIBS.</li>
	<li>Aftale med NETS for at underst&oslash;tte dankort (URL: http://tech.dibspayment.com/starter_guide ) - &rdquo;Some cards are only available through specific acquirers (for example Dankort through Nets/Teller)&rdquo;.</li>
</ul>

<h3 id="rapporter-for-betaling-af-mellemværende-i-dibs">Rapporter for betaling af mellemv&aelig;rende i DIBS</h3>

<p>Det er i DDB CMS muligt at se om brugernes betalinger er g&aring;et igennem til betaling via &ldquo;Indstillinger -&gt; Ding DIBS settings -&gt; DING DIBS REPORTS&rdquo; (Sti: admin/config/payment/ding_dibs/reports)</p>

<p>BrugerID, som findes i kolonnen &quot;Bruger&quot; p&aring; (Sti: admin/config/payment/ding_dibs/reports), kan du anvende til at finde navn og email ved at:</p>

<ol>
	<li>Logge ind og g&aring; til (URL: https://[bibliotekets_domæne].dk/user/[BRUGERID]/edit), hvor [BRUGERID] er brugerid&#39;et</li>
	<li>Skifte til fanebladet Brugerprofil, hvor du kan se de oplysninger brugeren har i DDB CMS.</li>
</ol>

<h3 id="cleared-paid-captured">Cleared, Paid, Captured:</h3>

<p>I rapporten for betaling af mellemv&aelig;rende figurerer en r&aelig;kke kolonner: Cleared, Paid og Captured. De betyder f&oslash;lgende:</p>

<ul>
	<li>Cleared: L&aring;neren har indtastet kreditkortoplysninger og disse er godkendt.</li>
	<li>Paid: Betalingen gennemf&oslash;rt i bibliotekssystemet.</li>
	<li>Captured: Pengene h&aelig;vet p&aring; l&aring;nerens kort.</li>
</ul>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/1348/7.1.%20DingDibs%20Settings.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="fejlsøgning-herunder-mulighed-for-at-administrator-kan-få-tilsendt-en-mail-i-tilfælde-af-dibs-fejl">Fejls&oslash;gning, herunder mulighed for at administrator kan f&aring; tilsendt en mail i tilf&aelig;lde af DIBS fejl</h3>

<p><img alt="" data-rich-file-id="392" src="/system/rich/rich_files/rich_files/000/000/392/original/Udklip.PNG" style="border-width: 2px; border-style: solid;" /></p>

<p>Dibsrapporten admin/config/payment/ding_dibs/reports indeholder oplysninger for godkendte/betalte regninger og regninger med fejl.</p>

<p>I forbindelse med fejls&oslash;gning er der behov at kunne finde de regninger/transaktioner der en gang mellem fejler.<br />
Det er muligt at konfigurere DDB CMS s&aring; der sendes en mail i disse tilf&aelig;lde:</p>

<p>G&aring; ind under /admin/config/payment/ding_dibs/emails<br />
I SET THE DAILY HOUR TO RUN THIS CRON indstillet hvor ofte dibstransaktionerne skal l&oslash;bes igennem</p>

<p>i <strong>Input emails that should be notified if something unusual happens with a payment.</strong> angiver man den emailadresse fejl-transaktionerne skal sendes til.</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2295/dibs%20rapport.png" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="verifikation-af-transaktioner-i-bibliotekssystemet-og-dibs">Verifikation af transaktioner i bibliotekssystemet og DIBS</h3>

<p>I FBS kan regningsnumrene og brugerID fra DIBS-rapporterne i DDB CMS bruges til at frems&oslash;ge regningerne.</p>

<p>I DIBS admin (https://payment.architrade.com/admin/) kan regningsnumrene ogs&aring; bruges til at frems&oslash;ge regningerne.</p>

<ol>
	<li>Brugerid findes i kolonnen &quot;Bruger&quot;, kan du bruge i DDB CMS til at finde navn og email ved at:</li>
	<li>Regningsnumrene findes i kolonnen &quot;Tekst&quot; og starter med &quot;Payment of library dues: .....&quot;</li>
</ol>

<h3 id="indstillinger-biblioteket-selv-skal-konfigurere">Indstillinger biblioteket selv skal konfigurere:</h3>

<p><strong>Udfyld transaktionsnummer:</strong></p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; DIBS-indstillinger -&gt; Ding DIBS debts payment (klik p&aring; redig&eacute;r) (Sti: admin/config/payment/dibs/edit/ding_dibs/1).</li>
	<li>Inds&aelig;t transaktionsnummer i feltet &ldquo;N&aelig;ste ordre ID&rdquo; under afsnittet &ldquo;INDSTILLINGER FOR ORDRE ID&rdquo;. Tallet skal v&aelig;re h&oslash;jere end det antal transaktioner, der allerede er foretaget i bibliotekets DIBS-l&oslash;sning.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<p><strong>Inds&aelig;t tekst omkring brugsbetingelser for betalingstjenesten:</strong><br />
#&Aring;bn &ldquo;Indstillinger -&gt; Ding DIBS settings&rdquo; (Sti: admin/config/payment/ding_dibs)</p>

<ol>
	<li>Udfyld felterne &ldquo;Terms of sale (english)&rdquo; og &ldquo;Terms of sale (danish)&rdquo; med tekst, der beskriver vilk&aring;r for betaling. Se eksempel p&aring; tekst nedenfor.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h3 id="eksempel-på-tekst-for-vilkår-for-betaling">Eksempel p&aring; tekst for vilk&aring;r for betaling:</h3>

<p>&ldquo; <em>Du sendes videre til betalingsvindue hos DIBS.</em></p>

<p><em>Betalingen foreg&aring;r i danske kroner, DKK og den kan ikke fortrydes.</em></p>

<p><em>Du kan betale med f&oslash;lgende kort:</em><br />
<em>Dankort/VISA-Dankort, Mastercard, Maestro, Visa, Visa Electron, American Express og JCB.</em></p>

<p><em>Aarhus Kommunes Biblioteker</em><br />
<em>M&oslash;llegade 1</em><br />
<em>8000 Aarhus C,</em></p>

<p><em>Tlf: 89409200</em><br />
<em>CVR: 55133018&rdquo;</em></p>

<h3 id="kreditkort-hvilke-kort-kan-der-betales-med.">Kreditkort: Hvilke kort kan der betales med.</h3>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Ding DIBS settings&rdquo; (Sti: admin/config/payment/ding_dibs).</li>
	<li>Marker de kreditkort, eller andre betalingsl&oslash;sninger f. eks. Mobile Pay, som biblioteket &oslash;nsker at underst&oslash;tte i forbindelse med online betaling. L&aelig;s i &oslash;vrigt om MobilePay her [[http://platform.dandigbib.org/projects/ddb-cms/wiki/DDBCMSManual#Mobile-Pay]]</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<p><img alt="" data-rich-file-id="393" src="/system/rich/rich_files/rich_files/000/000/393/original/Udklip.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="udfyld-dibs-automatic-capture-url">Udfyld DIBS automatic capture URL</h3>

<p><strong>Vigtigt - dette felt skal v&aelig;re udfyldt for, at betalingsprocessen bliver gennemf&oslash;rt</strong></p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Ding DIBS settings&rdquo; (Sti: admin/config/payment/ding_dibs).</li>
	<li>Udfyld feltet &ldquo;DIBS automatic capture URL&rdquo; med URL&rsquo;en: https://payment.architrade.com/cgi-bin/capture.cgi.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h3 id="indstillinger-der-er-konfigureret-på-forhånd">Indstillinger der er konfigureret p&aring; forh&aring;nd:</h3>

<p>En r&aelig;kke indstillinger under &ldquo;Indstillinger -&gt; DIBS-indstillinger -&gt; redig&eacute;r (Ding DIBS debts payment)&rdquo; (Sti: admin/config/payment/dibs/edit/ding_dibs/1) vil v&aelig;re konfigureret p&aring; forh&aring;nd. Der benyttes f&oslash;lgende v&aelig;rdier i felterne under de forskellige afsnit:</p>

<p>Afsnittet &ldquo;Generelle indstillinger for DIBS&rdquo;:</p>

<ul>
	<li>Merchant ID: Merchant ID er som udgangspunkt det brugernavn, der er tilknyttet din DIBS-konto og kan finde i DIBS&rsquo; administrationsgr&aelig;nseflade.</li>
	<li>Konto: skal ikke udfyldes.</li>
	<li>Testtilstand: V&aelig;lg &ldquo;Nej&rdquo;.</li>
	<li>Windows type: V&aelig;lg &ldquo;Flex window&rdquo;.</li>
	<li>Order id handling after cancel: V&aelig;lg &ldquo;Generate new order ID&rdquo;.</li>
	<li>Udf&oslash;r MD5-kontrol: V&aelig;lg &ldquo;Ja&rdquo;.</li>
	<li>MD5-n&oslash;gle 1: (kan v&aelig;re udfyldt hvis I har leveret konfigurationsoplysningerne til DDB inden etablering af produktionsmil&oslash;jet i uge 26 2014).</li>
	<li>MD5-n&oslash;gle 2: (kan v&aelig;re udfyldt hvis I har leveret konfigurationsoplysningerne til DDB inden etablering af produktionsmil&oslash;jet i uge 26 2014).</li>
	<li>Sprog: V&aelig;lg &ldquo;Danish&rdquo;.</li>
	<li>Valuta: V&aelig;lg &ldquo;Danske kroner (DKK)&rdquo;.</li>
</ul>

<p>Afsnittet &ldquo;Indstillinger for betalingsvindue&rdquo;:</p>

<ul>
	<li>Farvetema: Giver mulighed for at v&aelig;lge imellem: sand, gr&aring; eller bl&aring;.</li>
</ul>

<p>Afsnittet &ldquo;Indstillinger for flex windo&rdquo;:</p>

<ul>
	<li>Farvetema: V&aelig;lg i mellem sand, gr&aring; eller bl&aring;.</li>
	<li>Decorator: V&aelig;lg &ldquo;Tilpasset&rdquo;</li>
	<li>Kupon: V&aelig;lg &ldquo;Nej&rdquo;</li>
</ul>

<p>Afsnittet &ldquo;Indstillinger for ordre ID&rdquo;:<br />
*N&aelig;ste ordre ID: Inds&aelig;t et tal, der er h&oslash;jere end det antal transaktioner, der allerede er foretaget i Bibliotekets DIBS l&oslash;sning.<br />
*Order ID prefix: Inds&aelig;t biblioteksnummer (ISIL/Agency)</p>

<ul>
	<li>Order ID suffix: Skal ikke udfyldes.</li>
</ul>

<p>Afsnittet &ldquo;Callback URL&rsquo;s&rdquo;:</p>

<ul>
	<li>Accept URL: Inds&aelig;t &ldquo;payment/dibs/accept&rdquo;.</li>
	<li>Cancel URL: Inds&aelig;t &ldquo;payment/dibs/cancel&rdquo;.</li>
	<li>OK URL: Inds&aelig;t &ldquo;payment/dibs/callbackok&rdquo;.</li>
</ul>

<p>Avancerede indstillinger:</p>

<ul>
	<li>Calc fee: V&aelig;lg &ldquo;Nej&rdquo;.</li>
	<li>Capture now: V&aelig;lg &ldquo;Nej&rdquo;.</li>
	<li>Unique order ID: V&aelig;lg &ldquo;Ja&rdquo;.</li>
</ul>

<h2 id="indstillinger-for-reservering">Indstillinger for reservering</h2>

<h3 id="interesseperiode-for-reserveret-materiale">Interesseperiode for reserveret materiale</h3>

<p>N&aring;r man reserverer et materiale via DDB CMS, vil reserveringen blive tildelt en interesseperiode. Du har mulighed for at v&aelig;lge en default interesseperiode p&aring; 1<del>, 2</del>, 3<del>, 6</del> eller 12 m&aring;ned/m&aring;neder. Hvis l&aring;neren ikke selv har valgt en interesseperiode, bruges som udgangspunkt default-v&aelig;rdien. Du kan deaktivere interesseperioden i brugerprofilen ved at s&aelig;tte flueben i &quot;Disable interest period&quot;, hvorved du fratager l&aring;nerne muligheden for at &aelig;ndre deres default interesseperiode selv (g&aelig;lder ikke FBS hvor dette er standard).</p>

<p><strong>&AElig;ndre default interesseperiode</strong></p>

<p>I FBS er det pt. ikke muligt at s&aelig;tte default interessedato p&aring; brugerprofilen.</p>

<h2 id="tilladafvis-sletning-af-reserveringer">Tillad/afvis sletning af reserveringer</h2>

<p>I DDB CMS skal du bestemme, om l&aring;nerne skal kunne slette reserveringer (incl. opfyldte reserveringer) fra hjemmesiden. {background:yellow}.</p>

<p>DDB CMS er fra start indstillet til at tillade sletning af reserveringer. Vil du &aelig;ndre p&aring; dette g&oslash;res det p&aring; f&oslash;lgende m&aring;de.</p>

<p><strong>Konfigur&eacute;r tillad eller afvis sletning af reserveringer</strong><br />
G&aring; til &ldquo;Indstillinger -&gt; Ding provider -&gt; FBS Provider&rdquo; (Sti: admin/config/ding/provider/fbs).</p>

<ol>
	<li>S&aelig;t flueben i checkboksen &ldquo;Enable reservation deletion&rdquo; hvis l&aring;nerne skal have mulighed for at slette reservationer.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h2>S&oslash;gning i Databr&oslash;nden</h2>

<h3>Br&oslash;ndprofiler i VIP basen</h3>

<p>F&oslash;r det er muligt at frems&oslash;ge materialer i DDB CMS, skal du igennem to trin:</p>

<ol>
	<li>Oprette og konfigurere en br&oslash;ndprofil i VIP-basen (URL: http://vip.dbc.dk)</li>
	<li>Indstille en s&oslash;geprofil i DDB CMS, som benytter br&oslash;ndprofilen</li>
</ol>

<h3 id="opret-og-konfigurer-en-brøndprofil">Opret og konfigurer en br&oslash;ndprofil:</h3>

<ol>
	<li>Fra forsiden af VIP basen: Under &ldquo;J. Br&oslash;ndprofiler&rdquo; klik p&aring; &ldquo;2. OpenSearch 3.x, 4x&rdquo;.</li>
	<li>Klik p&aring; &ldquo;Tilf&oslash;j profil&rdquo;.</li>
	<li>Udfyld profilen med navn og s&aelig;t flueben ved de kilder, du &oslash;nsker skal v&aelig;re tilg&aelig;ngelige gennem profilen. V&aelig;lg som minimum kilden &ldquo;Bibliotekets katalog&rdquo; for at s&oslash;ge i de bibliografiske poster.</li>
	<li>Tryk &ldquo;Gem&rdquo;.</li>
</ol>

<p>Under trin 3 ovenover anbefales at v&aelig;lge navnet &ldquo;opac&rdquo; til br&oslash;ndprofilen. Som udgangspunkt er DDB CMS konfigureret med dette profilnavn.</p>

<p>Se desuden DBC&#39;s side om br&oslash;ndprofiler p&aring; http://www.danbib.dk/index.php?doc=broend3_kilder</p>

<h3 id="indstilling-af-søgeprofil-i-ddb-cms.">Indstilling af s&oslash;geprofil i DDB CMS.</h3>

<p>Hvis du har valgt navnet &ldquo;opac&rdquo; til s&oslash;geprofilen, er det ikke n&oslash;dvendigt, du foretager dig yderligere. Har du valgt et andet navn i VIP-basen skal du inds&aelig;tte navnet som s&oslash;geprofil under &ldquo;Indstillinger -&gt; Ting -&gt; Search profile&rdquo; (Sti: admin/config/ting/settings).</p>

<h3 id="konfiguration-af-søgning---opensearch-og-databrønden">Konfiguration DDB CMS for s&oslash;gning i Databr&oslash;nden via Opensearch webservicen</h3>

<p>Opensearch er den eksterne s&oslash;geservice, DDB CMS sender foresp&oslash;rgsler til, n&aring;r der skal hentes bibliografiske poster i databr&oslash;nden.</p>

<p>Som udgangspunkt er DDB CMS konfigureret, s&aring; hjemmesiden peger mod den seneste udgave af s&oslash;geservicen. I forbindelse med at nye versioner af opensearch frigives, er det muligt lokalt at pege p&aring; den nye version af Opensearch servicen.</p>

<p><strong>Konfigurer integration til opensearch og databr&oslash;nden.</strong></p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Opensearch -&gt; Provider settings (Sti: admin/config/opensearch/settings).</li>
	<li>Udfyld felterne p&aring; f&oslash;lgende m&aring;de:<br />
	Bibliotekskode: [biblioteksnummeret]<br />
	Search service URL: https://opensearch.addi.dk/b3.5_5.0/<br />
	Recommendation service URL: http://openadhl.addi.dk/1.1/<br />
	Search profile: [Inds&aelig;t navnet p&aring; den s&oslash;geprofil biblioteket har konfigureret i VIP basen]<br />
	Infomedia web service URL: https://useraccessinfomedia.addi.dk/1.4<br />
	Enable logging: [Udfyldes ikke]<br />
	Cache lifetime: 15 minutter.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h3 id="søgeresultater-konfigurer-indstillinger-for-visning.">S&oslash;geresultater: konfigurer indstillinger for visning.</h3>

<p>I DDB CMS er det muligt at konfigurere visningen af s&oslash;geresultater p&aring; forskellig vis.. F.eks. hvor mange s&oslash;geresultater, der skal vises pr. side og antallet af termer ved facetter. Konfiguration af s&oslash;geresultater kontrolleres fra siden &ldquo;S&oslash;geindstillinger&rdquo;:</p>

<p><strong>Konfigurer indstillinger for visning af s&oslash;geresultater:</strong></p>

<ol>
	<li>G&aring; til &ldquo;Indstillinger -&gt; Materialer -&gt; S&oslash;geindstillinger&rdquo; (Sti: admin/config/ting/search).</li>
	<li>Konfigurer indstillinger (de forskellige valgmuligheder gennemg&aring;s nedenunder).</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<p><strong>Gennemgang af konfigurationsmuligheder under &ldquo;S&oslash;geindstillinger&rdquo;</strong></p>

<ul>
	<li>Default results per page: Feltet definerer antallet af s&oslash;geresultater per side (paginering). Som udgangspunkt vises 10 s&oslash;geresultater.</li>
	<li>Number of facets: Feltet definerer antallet af termer, der hentes fra br&oslash;nden per facet. Som udgangspunkt hentes 10 termer. Ved at s&aelig;tte tallet h&oslash;jere vises en &quot;Vis flere&quot; og &quot;Vis f&aelig;rre&quot; valgmulighed n&aring;r man folder en facetgruppe ud.</li>
	<li>Series title: Feltet definerer hvilket indeks, der benyttes ved klik p&aring; serietitler. Feltet er p&aring; forh&aring;nd v&aelig;re udfyldt med &ldquo;phrase.titleSeries=&quot;@serietitle&quot; &rdquo;, som er det eneste indeks, der kan anvendes.</li>
	<li>Default sorting: Dropdownmenuen giver mulighed for at v&aelig;lge hvilke sorteringskriterier, der som udgangspunkt skal anvendes p&aring; s&oslash;geresultaterne. Der kan v&aelig;lges mellem syv sorteringer, bl.a. efter alfabetisk orden p&aring; titler og forfatter. Som udgangspunkt er valg &quot;Sorter efter Bedste match&quot;. Det er n&oslash;dvendigt at v&aelig;lge &quot;Sorter efter Bedste match&quot; hvis du &oslash;nsker at anvende &quot;rank_frequency&quot; ellers vil sorteringen sl&aring; over p&aring; &quot;rank_general&quot; (se afsnittet &quot;Rangering og Boost&quot;).</li>
	<li>Display message: Feltet giver mulighed for at inds&aelig;tte hj&aelig;lpetekst, der vises for brugerne ved mange s&oslash;geresultater. Hensigten er, at teksten skal vejlede l&aring;neren i hvordan s&oslash;gningen afgr&aelig;nses. Som udgangspunkt vises teksten &ldquo;Din s&oslash;gning gav over %s resultater. Pr&oslash;v at s&oslash;ge mere n&oslash;jagtigt eller brug facetterne i menuen til venstre for at afgr&aelig;nse din s&oslash;gning.&rdquo;. Teksten vises over s&oslash;geresultaterne p&aring; hver s&oslash;geside i en s&oslash;gning, s&aring; det er en god ide at fatte sig i korthed.</li>
	<li>Display message at: I feltet indtastes gr&aelig;nsev&aelig;rdien for antallet af s&oslash;geresultater, der skal udl&oslash;se hj&aelig;lpeteksten. Som udgangspunkt er der valg 100. L&aelig;s mere om ops&aelig;tning af hj&aelig;lpetekster ved mange s&oslash;geresultater nedenunder.</li>
	<li>Search form style (S&oslash;geprofiler - mulighed med modulet ting_field_search, ogs&aring; kaldet Vejle-modulet): Valgmulighederne er Normal, Extended og Extended with profiles</li>
</ul>

<h3 id="søgefelt">S&oslash;gefelt: normalt, udvidet eller udvidet med profiler</h3>

<p>Der er tre m&aring;der s&oslash;gefeltet kan se ud: normal, udvidet og udvidet med profiler.</p>

<p>Hvilken m&aring;de s&oslash;gefeltet ser ud, rettes under Indstillinger -&gt; Materialer -&gt; S&oslash;geindstillinger (Sti: /admin/config/ting/search)</p>

<p>NB! Ryd cachen efter indstillingerne er rettet, for at rettelserne bliver vist.</p>

<p><img alt="" data-rich-file-id="23" src="/system/rich/rich_files/rich_files/000/000/023/original/search_dump4.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="normal-visning---billedet-til-højre-viser-hvordan-søgefeltet-udvider-sig-når-bruger-skriver-i-felet">Normal visning - billedet til h&oslash;jre viser, hvordan s&oslash;gefeltet udvider sig, n&aring;r bruger skriver i felet</h4>

<p><img alt="" data-rich-file-id="21" src="/system/rich/rich_files/rich_files/000/000/021/original/search_dump1.PNG" style="border-width: 2px; border-style: solid;" /> <img alt="" data-rich-file-id="20" src="/system/rich/rich_files/rich_files/000/000/020/original/search_dump2.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="udvidet-extended">Udvidet (extended)</h4>

<p><img alt="" data-rich-file-id="24" src="/system/rich/rich_files/rich_files/000/000/024/original/search_dump5.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="udvidet-med-profiler-extended-with-profiles">Udvidet med profiler (extended with profiles)</h4>

<p><a href="https://platform.dandigbib.org/projects/ddb-cms/wiki/Ddb-cms-manual_konfiguration_next-version#S%C3%B8geprofiler-ting_field_search">Vejledning i at konfigurere profilerne</a>.</p>

<p><img alt="" data-rich-file-id="22" src="/system/rich/rich_files/rich_files/000/000/022/original/search_dump3.PNG" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="visning-af-beholdningsoplysninger-sektionen-se-alle-eksemplarer">Visning af beholdningsoplysninger (sektionen &quot;Se alle eksemplarer)</h3>

<p>Det er muligt at v&aelig;lge om sektionen med beholdningsoplysninger som udgangspunkt skal v&aelig;re udfoldet p&aring; de enkelte materialeposter eller lukket s&aring; brugeren aktivt skal klikke p&aring; sektionen for at folde den ud. Som udgangspunkt er sektionen med beholdningsoplysninger lukket. Visningen kontrolleres p&aring; f&oslash;lgende m&aring;de:</p>

<ol>
	<li>&Aring;ben &quot;Indstillinger &gt; Ting/Materialer &gt; Ting/Materialer &gt; Local settings&quot; eller tilg&aring; siden direkte ved at inds&aelig;tte admin/config/ting/settings/local_config efter bibliotekets dom&aelig;ne i browseren.<br />
	<img alt="" data-rich-file-id="374" src="/system/rich/rich_files/rich_files/000/000/374/original/Udklip.PNG" style="border-width: 2px; border-style: solid;" /></li>
	<li>V&aelig;lg fra dropdownmenuen &quot;Group holdings available&quot; mellem indstillingerne &quot;Default (don&#39;t change)&quot; (defaultv&aelig;rdi - dvs. lukket), &quot;Open&quot; (&Aring;ben uden mulighed for at lukke), &quot;Collapsed&quot; (lukket), &quot;Collapsible&quot; (&Aring;ben, med mulighed for at lukke).<br />
	<img alt="" src="http://platform.dandigbib.org/attachments/download/1642/Sektionen%20Se%20alle%20eksemplarer%20konfig2.jpg" style="border-width: 2px; border-style: solid;" /></li>
	<li>Klik p&aring; knappen &quot;Gem indstillinger&quot;.</li>
</ol>

<h3 id="søgning-hjælpetekst-ved-mange-søgeresultater">S&oslash;gning: Hj&aelig;lpetekst ved mange s&oslash;geresultater</h3>

<p>Hvis brugeren har lavet en s&oslash;gning, som resulterer i mange s&oslash;geresultater, viser DDB CMS en hj&aelig;lpetekst, som beskriver hvordan s&oslash;geresultatet kan indskr&aelig;nkes. Fra backenden er det muligt at bestemme hvor mange s&oslash;geresultater, der skal v&aelig;re, f&oslash;r hj&aelig;lpeteksten vises - hj&aelig;lpeteksten kan rettes i Overs&aelig;ttelse (/admin/config/regional/translate/translate).</p>

<p><strong>Udfyld hj&aelig;lpetekst og gr&aelig;nsev&aelig;rdi:</strong></p>

<ol>
	<li>G&aring; til &ldquo;Indstillinger -&gt; S&oslash;geindstillinger (se under afsnittet &ldquo;TING&rdquo;)&rdquo; (Sti: admin/config/ting/search)</li>
	<li>I feltet &ldquo;Display message&rdquo; vises hj&aelig;lpeteksten.</li>
	<li>I feltet &ldquo;Display message at&rdquo; indtastes gr&aelig;nsev&aelig;rdien for antallet af s&oslash;geresultater, der skal udl&oslash;se hj&aelig;lpeteksten.</li>
</ol>

<h3 id="facetbrowser">Facetbrowser</h3>

<p>Facetbrowseren er navnet p&aring; de forskellige muligheder for afgr&aelig;nsning, man finder i venstre side i forbindelse med materiales&oslash;gninger. Afgr&aelig;nsningerne kan f.eks. v&aelig;re p&aring; materialetype, forfatter og emne. Disse forskellige typer af afgr&aelig;nsninger kaldes facetgrupper.</p>

<p>I DDB CMS er det muligt at konfigurere ops&aelig;tningen af facetbrowseren og bl.a. styre hvilke facetgrupper, der vises, r&aelig;kkef&oslash;lgen af disse, hvor mange facetter, der vises under de enkelte facetgrupper og lignende. Som udgangspunkt er facetbrowseren konfigureret med facetgrupperne &ldquo;Materialetype&rdquo;, &ldquo;Forfatter&rdquo;, &ldquo;Emne&rdquo;, &ldquo;Sprog&rdquo;, &ldquo;M&aring;lgruppe&rdquo;, &ldquo;&Aring;rstal&rdquo; og &ldquo;Kilde&rdquo;.</p>

<p>Facetgrupperne i facetbrowseren opbygges ud fra de facet-indekser der findes p&aring; https://opensearch.addi.dk/b3.5_4.5/?showCqlFile&repository=prod&cql=opensearch_cql.xml#facet.</p>

<p><strong>Tilf&oslash;j facetgruppe</strong><br />
Under &ldquo;Ting facets&rdquo; er det muligt tilf&oslash;je nye facetter.</p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Ting facets (Under afsnittet &ldquo;Ting&rdquo;)&rdquo; (Sti: https://bibliotekets-hjemmesideadresse.dk/admin/config/ting/facets).</li>
	<li>Tilf&oslash;j en ny facet ved at udfylde &ldquo;Facet ID&rdquo; og &ldquo;Titel&rdquo; og v&aelig;lg hvilken sortering, der skal anvendes for den enkelte facet. Du kan finde en tabel over tilg&aelig;ngelige facetgrupper p&aring; https://opensearch.addi.dk/b3.5_4.5/?showCqlFile&repository=prod&cql=opensearch_cql.xml#facet. Find &ldquo;Facet&rdquo; i kolonnen &ldquo;Namespace&rdquo; i tabellen. *</li>
	<li>Klik p&aring; knappen &ldquo;Gem &aelig;ndringer&rdquo;.</li>
</ol>

<p><strong>Muligheder under &ldquo;Ting facets&rdquo;</strong><br />
Nedenfor er en kort beskrivelse af andre vigtige felter og konfigurationsmuligheder under &ldquo;Ting facets&rdquo;:</p>

<ul>
	<li>&ldquo;Visible facets amount&quot;: Dropdownmenuen giver mulighed for at bestemme, hvor mange facetgrupper, der som udgangspunkt skal v&aelig;re &aring;bne i gr&aelig;nsefladen. Det betyder at brugerne kan se indholdet af facetgruppen, uden f&oslash;rst at &aring;bne den. Der kan v&aelig;lges fra 1 til 15 &aring;bne facetgrupper. Det anbefales ikke at have en lang liste med &aring;bne facetgrupper, da siden kan blive meget lang og i sidste ende sv&aelig;r at overskue for brugerne.</li>
	<li>&quot;Number of terms&quot; angiver antallet af synlige facetter i hver facetgruppe. Antallet af termer, der hentes, er som default 10. Bem&aelig;rk at antallet af facetter afh&aelig;nger af hvor mange termer, der er tilg&aelig;ngelige i br&oslash;nden. Selvom der st&aring;r &ldquo;10&rdquo; i &ldquo;Number of terms&rdquo; vil der kun blive vist fem facetter, hvis der kun er fem termer i br&oslash;nden.</li>
	<li>Skift r&aelig;kkef&oslash;lgen af facetgrupper ved at klikke og tr&aelig;kke p&aring; korspilen yderst til venstre ud for en facetgruppe.</li>
</ul>

<h3 id="knapper-på-online-materiale-konfigurer-tekst-på-knapper.">Knapper p&aring; online materiale: Konfigurer tekst p&aring; knapper.</h3>

<p>Under &ldquo;Online types and URL labes&rdquo; er det muligt at tilpasse teksten p&aring; knapper p&aring; online materialer.</p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; &ldquo;Online types and URL labels&rdquo; (URL: admin/config/ting/online_types)</li>
	<li>Tryk p&aring; knappen opdat&eacute;r. Alle materialetyper, som er repr&aelig;senteret i bibliotekets kilder hentes nu fra br&oslash;nden.</li>
	<li>Tryk p&aring; &quot;Online types&quot; for at folde listen med materialetyper ud.</li>
	<li>Marker de materialetyper, der skal kunne tilg&aring;s online.</li>
	<li>Tryk p&aring; &quot;Type specific labels&rdquo; for at folde listen med materialetyper ud, hvor teksten p&aring; knapper kan &aelig;ndres.</li>
	<li>Find f.eks. &quot;film (net)&quot; p&aring; listen og skriv f.eks. &quot;Se filmen&quot; i feltet</li>
	<li>Tryk p&aring; knappen &quot;Gem indstillinger&quot; nederst p&aring; siden.</li>
</ol>

<p>Materialetyper der med fordel kan tildeles knappen &quot;Se online&quot; (har relationen hasOnlineAccess). Se http://osswiki.dbc.dk/bin/view/Databroend/KilderBroend3 for overblik over kilder med relationen hasOnlineAccess.</p>

<p>Bem&aelig;rk at en kildes materialetyper kan frems&oslash;ges via f&oslash;lgende s&oslash;gning: term.acSource=&quot;KILDENS NAVN&quot;, hvor de er synlige i s&oslash;geresultatet, hvis facetgruppen facet.type er aktiveret.</p>

<h3 id="beholdningsoplysninger-på-materiale.">Beholdningsoplysninger p&aring; materiale.</h3>

<p>Under &ldquo;Provider availability holdings&rdquo; kan du angive hvilke materialer, der skal tildeles beholdningsoplysninger.</p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Provider availability holdings&rdquo; (Sti: admin/config/ting/holdings)</li>
	<li>Tryk p&aring; knappen opdat&eacute;r. Alle materialetyper som er repr&aelig;senteret i de bibliografiske poster hentes nu fra br&oslash;nden.</li>
	<li>Marker de materialetyper, der skal tildeles beholdningsoplysninger.</li>
	<li>Tryk p&aring; knappen &quot;Gem indstillinger&quot; nederst p&aring; siden.</li>
</ol>

<p>V&aelig;r opm&aelig;rksom p&aring; at materialetyperne med &aring;rgange/numre, dvs. Tidsskrift, &Aring;rbog og Periodikum ikke m&aring; markeres, da beholdningsoplysninger for disse materialetyper ikke kan inds&aelig;ttes p&aring; pif-posten, men p&aring; &aring;rgange/numre.</p>

<h3>Beholdningsoplysninger - Opstilling</h3>

<p>Under Indstillinger &gt; Materialer &gt; Provider availability holdings (Sti:&nbsp;/admin/config/ting/holdings) kan man tilpasse opstillingssignaturen.</p>

<p>Beholdningsvisningen kan best&aring;&nbsp;af forskellige niveauer for opstilling der kan konfigureres s&aring; det afspejler&nbsp;lokal praksis.</p>

<p>F&oslash;lgende fire niveauer vises altid:</p>

<p>Branch &gt; Department &gt; Location &gt; Sublocation</p>

<p>Derudover kan man v&aelig;lge at f&aring; vist:</p>

<ul>
	<li>Material group description - Materialegruppe</li>
	<li>Simple - DK5&nbsp;Klassem&aelig;rke + Inverteret forfatternavn</li>
	<li>Shelfmark - Hyldem&aelig;rke</li>
</ul>

<p>Man kan lave f&oslash;lgende kombinationer:</p>

<p><strong>Simple </strong>(Default konfiguration)<br />
Greve Bibliotek &gt; B&oslash;rn &gt; 77.693 &gt; Revenson, Judy</p>

<p><strong>Simple + Material group description</strong><br />
Greve Bibliotek &gt; B&oslash;rn &gt; Bog &gt; 77.693 &gt; Revenson, Judy</p>

<p><strong>Shelf mark </strong>(simulerer DDELibras opstilling med differentieret visning for f. eks. sk&oslash;n- og faglitteratur)<br />
Greve Bibliotek &gt; B&oslash;rn &gt; Enest&aring;ende</p>

<p><strong>Shelf mark + Material group description</strong><br />
Greve Bibliotek &gt; B&oslash;rn &gt; Bog &gt; Enest&aring;ende</p>

<h5>Beskrivelse af shelfmark</h5>

<p>1.<br />
Hvis felt 652 delfelt m = sk<br />
Vises 1. ord (efter evt. soltegn) i felt 100 delfelt a<br />
Hvis felt 100 mangler vises 1. ord (efter evt. soltegn) i 110 delfelt a<br />
Hvis felt 100 og felt 110 mangler vises 1. ord (efter evt. soltegn) i 245 delfelt a</p>

<p>2. &nbsp;<br />
Hvis felt 652 delfelt m ikke = sk og posten indeholder felt 039&nbsp;<br />
Vises indholdet i felt 039 delfelterne a + b (bogstavskoderne overs&aelig;ttes, se herunder)&nbsp;</p>

<p>efterfulgt af&nbsp;</p>

<p>Hvis felt 100 vises 1. ord (efter evt. soltegn) i 100 delfelt a<br />
Hvis felt 100 mangler, vises 1. ord (efter evt. soltegn) i 110 delfelt a<br />
Hvis felt 100 og felt 110 mangler, vises 1. ord (efter evt. soltegn) i 239 delfelt a<br />
Hvis felt 100, felt 110 og felt 239 mangler, vises 1. ord (efter evt. soltegn) i 245 delfelt a</p>

<p>3.&nbsp;<br />
Hvis felt 652 delfelt m ikke = sk og der ikke er et felt 039</p>

<p>Vises indhold af felt 652 delfelt m (DK5-koden) + indhold i delfelt b</p>

<p>Hvis felt 652 delfelt b ikke findes - vises indhold i delfelt a + delfelt h (kommasepareret)<br />
(Forklarende tekst til 652 m vises ikke)</p>

<p>efterfulgt af (ligesom ovenfor)</p>

<p>Hvis felt 100 vises 1. ord (efter evt. soltegn) i 100 delfelt a<br />
Hvis felt 100 mangler, vises 1. ord (efter evt. soltegn) i 110 delfelt a<br />
Hvis felt 100 og felt 110 mangler, vises 1. ord (efter evt. soltegn) i 245 delfelt a</p>

<h3 id="materialer-til-reservation-tildeling-af-knap.">Materialer til reservation: tildeling af knap.</h3>

<p>Under &ldquo;Reservable Ting object&rdquo; er det muligt at bestemme hvilke materialer, der skal tildeles en knap til reservering.</p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Reservable Ting objects&rdquo; (URL: admin/config/ting/reservable)</li>
	<li>Tryk p&aring; &ldquo;Opdat&eacute;r&rdquo;. Alle materialetyper som er repr&aelig;senteret i de bibliografiske poster hentes nu fra br&oslash;nden.</li>
	<li>Marker de kilder (typisk kun &quot;bibliotekskatalog&quot;), hvis poster skal kunne tildeles en Reserv&eacute;r knap.</li>
	<li>Marker de Typer der skal tildeles en Reserv&eacute;r knap.</li>
	<li>Tryk p&aring; knappen &quot;Gem indstillinger&quot; nederst p&aring; siden.</li>
</ol>

<p>V&aelig;r opm&aelig;rksom p&aring; at materialetypen Tidsskrift IKKE m&aring; markeres da Reserv&eacute;rknapper for tidsskrifter ikke inds&aelig;ttes p&aring; pif-posten, men p&aring; &aring;rgange/numre.</p>

<h3 id="konfiguration-af-andre-services">S&oslash;geprofiler (ting_field_search)</h3>

<p>N&aring;r der v&aelig;lges udvidet s&oslash;gefelt med profilerne, s&aring; kan man under Indstillinger -&gt; Materialer -&gt; Ting Field Search Profiles &aelig;ndre, tilf&oslash;je og slette profilerne.</p>

<p>Som minimum skal profilen have en titel og en pr&aelig;defineret foresp&oslash;rgsel. Pr&oslash;v at tilf&oslash;je en profil - eks. med titel &quot;Sl&aelig;gtsforskning&quot;.<img alt="" src="ting-field-search_dump1.png" /></p>

<p>I feltet &quot;Foresp&oslash;rgsel&quot; er der tilf&oslash;jet et dk5-nr. for sl&aelig;gtsforskning, og mere kr&aelig;ves ikke. Foresp&oslash;rgslen kunne v&aelig;re mere avanceret, eller der kunne eks. ogs&aring; afgr&aelig;nses for, hvor gamle materialer der &oslash;nskes frems&oslash;gt i feltet &quot;New materials&quot;.</p>

<p>Under fanen &quot;S&oslash;geresultat&quot; i menuen til venstre, kan man ogs&aring; &aelig;ndre nogle parametre for, hvor mange resultater der vises pr. side eller hvilken sortering der &oslash;nskes. Og for den avancerede bruger, s&aring; er det ogs&aring; muligt under fanen &quot;Facets&quot;, at &aelig;ndre p&aring; hvilke facetter der vises til venstre i s&oslash;geresultatet.<img alt="" src="ting-field-search_dump2.png" /></p>

<p>OBS: Hvis man retter i en af default s&oslash;geprofilerne s&aring; bliver rettelsen overskrevet n&aelig;ste gang en ny version af DDB CMS udrulles. Dette kan omg&aring;s ved at deaktivere default s&oslash;geprofilen<img alt="" src="https://platform.dandigbib.org/projects/ddb-cms/wiki/ting-field-search_dump2.png" />&nbsp;og lave en ny der passer til bibliotekets behov, men dermed f&aring;r man heller ikke gl&aelig;de af eventuelle senere rettelser til den deaktiverede s&oslash;geprofil.</p>

<p>NB. Hvis man v&aelig;lger at klone en s&oslash;geprofil skal man &aelig;ndre maskinnavnet s&aring; det er unikt.</p>

<h3 id="rankering-og-boost">Rankering og Boost</h3>

<p>Rankering i forhold til s&oslash;gninger handler om i hvilken r&aelig;kkef&oslash;lge s&oslash;geresultaterne vises.</p>

<p>Overordnet set bestemmes rankeringen/r&aelig;kkef&oslash;lgen af s&oslash;geresultaterne, ved at felterne i de forskellige v&aelig;rker tildeles en v&aelig;rdi p&aring; baggrund af en r&aelig;kke kriterier. Jo h&oslash;jere v&aelig;rdi et v&aelig;rk samlet set tildeles, jo h&oslash;jere vil det figurere i s&oslash;geresultaterne. Nedenfor ses et udsnit af v&aelig;rket &ldquo;Hypnotiseret&rdquo; og et udsnit af de felter, der definerer den p&aring;g&aelig;ldende post i br&oslash;nden. I forbindelse med evt. rankering vil disse felter blive tildelt en v&aelig;rdi, som bestemmer postens placering i det s&oslash;geresultat, der vises for brugerne.</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/1576/hypnotisoren.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Et eksempel er, at brugeren laver en s&oslash;gning p&aring; &ldquo;Hypnotis&oslash;ren&rdquo;. Herefter unders&oslash;ger opensearch om s&oslash;gestrengen findes i et eller flere af felterne/indekserne p&aring; de s&oslash;gbare poster. P&aring; den baggrund tildeles de enkelte poster en v&aelig;gtning, som definerer r&aelig;kkef&oslash;lgen af de enkelte poster i s&oslash;geresultatet p&aring; DDB CMS. Hvordan v&aelig;rdien af de enkelte felter i et v&aelig;rk bestemmes afh&aelig;nger af hvilken s&oslash;gemetode, der anvendes.</p>

<p>I DDB CMS kan man som udgangspunkt v&aelig;lge mellem to pr&aelig;definerede metoder til at bestemme r&aelig;kkef&oslash;lgen af s&oslash;geresultaterne: &ldquo;Rank_frequency&rdquo; og &ldquo;Rank_general&rdquo;. Alternativt kan man v&aelig;lge &ldquo;No rank&rdquo; eller &ldquo;Custom ranking&rdquo;. I f&oslash;rstn&aelig;vnte tilf&aelig;lde vil s&oslash;geresultatet blive listet i den r&aelig;kkef&oslash;lge de enkelte poster er indekseret. Ved &ldquo;Custom ranking&rdquo; v&aelig;lger du selv hvilke felter, der skal rankeres p&aring; og deres v&aelig;rdi. Som udgangspunkt anvendes metoden &ldquo;Rank_frequency&rdquo; i DDB CMS.</p>

<h4 id="vælg-prædefinerede-rankeringmetode">V&aelig;lg pr&aelig;definerede rankeringmetode</h4>

<p>V&aelig;lg rankeringsmetode p&aring; f&oslash;lgende m&aring;de:</p>

<ol>
	<li>&Aring;ben &ldquo;Indstillinger -&gt;Search result ranking (under afsnittet &ldquo;Opensearch&rdquo;)&rdquo; (Sti: admin/config/opensearch/ranking)</li>
	<li>V&aelig;lg rankeringsmetode under dropdownmenuen &ldquo;Type&rdquo;. Der kan v&aelig;lges mellem &ldquo;Best match&rdquo; (er det samme som &ldquo;Rank frequency&rdquo;), General rank (er det samme som &ldquo;Rank general&rdquo;) eller &ldquo;No rank&rdquo;.<br />
	<img alt="" src="http://platform.dandigbib.org/attachments/download/1579/vaelg.png" style="border-width: 2px; border-style: solid;" /></li>
	<li>Tryk p&aring; knappen &ldquo;Gem &aelig;ndringer&rdquo; nederst p&aring; siden.</li>
</ol>

<h4 id="rank-frequency.">Rank frequency.</h4>

<p>&ldquo;Rank frequency&rdquo; anvendes som default rankering fra og med DDB CMS 2015 3. Nedenst&aring;ende beskrivelse af &quot;Rank frequency&quot; kan findes i sin oprindelige form i magasinet &quot;#DBC, nr.2, april 2015&quot;.</p>

<p>I forbindelse med at brugeren laver en s&oslash;gning &ldquo;g&aelig;tter&rdquo; &ldquo;Rank frequency&rdquo; p&aring; om brugeren s&oslash;ger efter titel, forfatter eller emne og v&aelig;lger dern&aelig;st en m&aring;de at rankere resultaterne p&aring;, som er god til netop d&eacute;n type s&oslash;gninger.</p>

<p>Der er lavet tre forskellige rankeringsalgoritmer: &eacute;n, der er egnet til titels&oslash;gninger, &eacute;n til forfatters&oslash;gninger og &eacute;n til emnes&oslash;gninger. N&aring;r rankeringsalgoritmen skal v&aelig;lge,<br />
hvilke s&oslash;geresultater, der skal vises f&oslash;rst, ser den blandt andet p&aring;, hvilke felter i posten, s&oslash;geordene optr&aelig;der i. For eksempel giver Titel-algoritmen en h&oslash;jere placering til poster, hvor s&oslash;geordene optr&aelig;der i feltet &rsquo;Hovedtitel&rsquo; frem for i andre titelfelter. Og hvis s&oslash;geordene ligefrem st&aring;r ved siden af hinanden i Hovedtitel-feltet, bliver posten endnu h&oslash;jere placeret.</p>

<p>I 80% af tilf&aelig;ldene v&aelig;lges den rigtige rankering. De s&oslash;gninger, hvor det ikke er tilf&aelig;ldet, er typisk, n&aring;r titels&oslash;gninger best&aring;r af navne &ndash; for eksempel, hvis man skriver &rsquo;Peter Pedal&rsquo;. Heldigvis f&aring;r man altid at vide, hvilken rankeringsform der er valgt, s&aring; man kan v&aelig;lge en anden, hvis det er n&oslash;dvendigt. P&aring; illustrationen nedenfor er der lavet en s&oslash;gning p&aring; &ldquo;Peter Pedal&rdquo;. I infoboksen beskrives at &ldquo;S&oslash;geresultatet er sorteret efter forfatter&rdquo;, mens dropdownmenuen giver mulighed for at v&aelig;lge en anden s&oslash;gning.</p>

<p><img alt="" src="Rank_frequency_dump1.png" /></p>

<p>Rank_frequency kan ikke anvendes sammen med rank/boost parametrene i &ldquo;custom ranking fields&rdquo; (se afsnittet &ldquo;Custom ranking: tilpas rankering med egne parametre&rdquo;).</p>

<h4 id="rank-general.">Rank general.</h4>

<p>Rankering af s&oslash;geresultatet udregnes ud fra den v&aelig;rdi felterne i posten tildeles, s&aring;ledes at v&aelig;rket med den h&oslash;jeste v&aelig;rdi vises f&oslash;rst. &ldquo;Rank general&rdquo; er karakteriseret, ved at den benytter en r&aelig;kke standardv&aelig;rdier til felterne &ldquo;Forfatter&rdquo;, &ldquo;Titel&rdquo;, &ldquo;Emne&rdquo; og &ldquo;default&rdquo; i forbindelse med rankeringen af s&oslash;geresultater. Posten med den h&oslash;jeste v&aelig;rdi vil ligge f&oslash;rst i s&oslash;geresultaterne. Nedenfor en beskrivelse af hvilke v&aelig;rdier &ldquo;Rank general&rdquo; tildeler de n&aelig;vnte felter:</p>

<table>
	<thead>
		<tr>
			<th>&nbsp;</th>
			<th>Forfatter</th>
			<th>Titel</th>
			<th>Emne</th>
			<th>Default</th>
		</tr>
	</thead>
	<tbody>
		<tr>
			<td>Term (v&aelig;gtning)</td>
			<td>4</td>
			<td>3</td>
			<td>2</td>
			<td>1</td>
		</tr>
		<tr>
			<td>Frase (v&aelig;gtning)</td>
			<td>8</td>
			<td>6</td>
			<td>3</td>
			<td>2</td>
		</tr>
	</tbody>
</table>

<h4 id="custom-ranking-tilpas-rankering-med-egne-parametre">Custom ranking: Tilpas rankering med egne parametre</h4>

<p>&ldquo;Custom ranking&rdquo; sorterer s&oslash;geresultatet efter de poster/v&aelig;rker hvor brugerens s&oslash;getermer optr&aelig;der i de felter/indekser lokaladministrator har defineret skal prioriteres.<br />
Med &ldquo;Custom ranking&rdquo; kan du dermed selv v&aelig;lge hvilke felter, der er vigtigst og som skal v&aelig;gtes h&oslash;jest i forbindelse med rankeringen. F.eks. kan det v&aelig;re, at du &oslash;nsker at definere at titler er vigtigere end forfatternavne, der igen er vigtigere end emner.<br />
Bem&aelig;rk at &ldquo;Custom ranking&rdquo; ikke kan anvendes sammen med &ldquo;Rank frequency&rdquo; eller &ldquo;Rank general&rdquo;. Har du aktiveret &ldquo;Custom ranking&rdquo; vil andre rankeringsmetoder blive sl&aring;et fra.<br />
Nedenfor er en beskrivelse af hvordan &ldquo;Custom ranking&rdquo; konfigureres:</p>

<ol>
	<li>&Aring;ben &ldquo;Indstillinger -&gt; Opensearch -&gt; Search result ranking&rdquo; (Sti: /admin/config/opensearch/ranking).</li>
	<li>Marker checkboksen &ldquo;Enable Custom Ranking&rdquo;<br />
	<img alt="" src="http://platform.dandigbib.org/attachments/download/1575/enableCustomRanking.png" style="border-width: 2px; border-style: solid;" /></li>
	<li>V&aelig;lg under &ldquo;Custom Ranking Fields&rdquo; hvilket felt der skal v&aelig;gtes (feltnavn), v&aelig;rdien for den p&aring;g&aelig;ldende v&aelig;gtning (v&aelig;gt) og hvilken type s&oslash;gninger v&aelig;gtningen skal g&aelig;lde for (type).</li>
	<li>Tryk p&aring; knappen &ldquo;Add another ranking field&rdquo; hvis du &oslash;nsker at tilf&oslash;je endnu et felt der skal rankeres p&aring;.</li>
	<li>Tryk p&aring; knappen &ldquo;Gem &aelig;ndringer&rdquo;.</li>
</ol>

<h4 id="custom-ranking-beskrivelse-af-indstillingsmuligheder.">Custom ranking: Beskrivelse af indstillingsmuligheder.</h4>

<p>Nedenfor er en beskrivelse af de forskellige indstillingsmuligheder under &ldquo;Custom ranking files&rdquo;:</p>

<ul>
	<li>Type: Feltet har to v&aelig;rdier: &ldquo;Frase&rdquo; og &ldquo;Ord&rdquo;. En frase best&aring;r af to eller flere s&oslash;geord f.eks. &ldquo;Klaus Rifbjerg&rdquo; eller &ldquo;k&oslash;d&aelig;dende plante&rdquo;.</li>
	<li>Feltnavn: Det er muligt at v&aelig;lge mellem f&oslash;lgende seks felter: &ldquo;kilde&rdquo;, &ldquo;titel&rdquo;, &ldquo;forfatter&rdquo;, &ldquo;emne&rdquo;, &ldquo;publiserings&aring;r&rdquo; og &ldquo;materialetype&rdquo;.</li>
	<li>V&aelig;rdi: V&aelig;lg en v&aelig;rdi fra 1 til 10. H&oslash;jere v&aelig;gt betyder h&oslash;jere placering i s&oslash;geresultaterne.</li>
</ul>

<p>Rankering er et komplekst emne og der er ikke nogen endegyldig l&oslash;sning. Unders&oslash;g konsekvenserne af tilpasningen grundigt med mange forskellige s&oslash;gninger og emner. Ved at fremme rankeringen af nogle materialetyper resulterer det typisk i at andre nedprioriteres.</p>

<h4 id="boost---fremhæv-specifikke-søgeposter.">Boost - fremh&aelig;v specifikke s&oslash;geposter.</h4>

<p>Boost sorterer s&oslash;geresultatet efter de poster/v&aelig;rker, som har bestemte felter/indekser med en bestemt v&aelig;rdi defineret af lokaladministrator. Her v&aelig;lger du alts&aring; hvilke v&aelig;rdier i bestemte felter, der er vigtigst, som f. eks. materialetypen bog eller sproget dansk.</p>

<p>Ops&aelig;tning af boost</p>

<ol>
	<li>&Aring;ben &ldquo;Indstillinger -&gt;Search result boost (under afsnittet &ldquo;Opensearch&rdquo;)&rdquo; (Sti: /admin/config/opensearch/boost).</li>
	<li>Ops&aelig;t forskellige felter med tilh&oslash;rende v&aelig;rdier, der skal fremh&aelig;ves i s&oslash;geresultaterne. Pt. kan der boostes p&aring; f&oslash;lgende otte felter: kilde, forfatter, udgivelses&aring;r, sprog, materialetype, emneord, dk5 (til brug for dette anvendes facet.dk5 hvor der s&aring; &rdquo;kun&rdquo; bustes p&aring; f&oslash;rste forekomst &rdquo;hovedopstilling&rdquo;) og ISBN. I feltet &ldquo;V&aelig;rdi&rdquo; angives v&aelig;rdien for det felt, man &oslash;nsker at booste p&aring;. I feltet v&aelig;gt angives v&aelig;rdien for den p&aring;g&aelig;ldende v&aelig;gt.</li>
	<li>Tryk p&aring; knappen &ldquo;Gem &aelig;ndringer&rdquo;.</li>
</ol>

<h4 id="querydebug">queryDebug</h4>

<p>Via webklienten til opensearch http://opensearch.addi.dk/4.0.1/ er muligt at se hvilken v&aelig;gt de enkelte s&oslash;geresultater tildeles ved at angive parameteren QueryDebug, som en del af foresp&oslash;rgslen. For at bruge webklienten foruds&aelig;tter dog, at DBC har &aring;bnet for kald fra den IP-adresse foresp&oslash;rgslen sendes fra. Alternativt er der fri adgang p&aring; DBC&rsquo;s testbr&oslash;nd http://oss-services.dbc.dk/opensearch/ som dog kun indeholder en delm&aelig;ngde af driftsbr&oslash;nden.</p>

<p>Eksempel p&aring; en simple-search s&oslash;gning p&aring; &ldquo;Hypnotis&oslash;ren&rdquo; med rankeringsmetoden &ldquo;Rank general&rdquo; og &ldquo;queryDebug&rdquo; angivet s&aring; den udregnede v&aelig;gt for s&oslash;geresultaterne vises.</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/1577/queryDebug1.png" style="border-width: 2px; border-style: solid;" /></p>

<p>S&oslash;geresultatet returneres med angivelse af hvilken v&aelig;gt de enkelte s&oslash;geresultater tildeles - se efter &ldquo;&rdquo; i s&oslash;geresultatet :</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/1578/queryDebug2.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Se desuden en beskrivelse af &oslash;vrige parametre der kan anvendes i forbindelse med foresp&oslash;rgsler til opensearch p&aring;:https://opensource.dbc.dk/services/open-search-web-service</p>

<h3 id="autofuldførsel-med-open-suggestion.">Autofuldf&oslash;rsel med &ldquo;Open Suggestion&rdquo;.</h3>

<p>N&aring;r servicen &ldquo;Open Suggestion&rdquo; er sl&aring;et til, vil l&aring;nerne i forbindelse med s&oslash;gninger p&aring; DDB CMS f&aring; vist forslag til autofuldf&oslash;relse af s&oslash;geord.</p>

<p>Servicen konfigureres p&aring; f&oslash;lgende m&aring;de:</p>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger - &gt; Opensearch -&gt; Ting search autocomplete setting (Sti: admin/config/opensearch/autocomplete).</li>
	<li>Udfyld felterne, som beskrevet nedenfor:<br />
	Autocomplete URL: For biblioteker der er p&aring; FBS inds&aelig;ttes: http://opensuggestion.addi.dk/b3.5_2.0/. Alle andre biblioteker inds&aelig;tter: http://opensuggestion.addi.dk/b3.0_2.0/<br />
	Match index: scanterm.default<br />
	Facet index: scanphrase.default<br />
	Filter Query:<br />
	Output sort order: count<br />
	Agency: [bibliotekets agency id] (Skal v&aelig;re det samme som i feltet &quot;Library code&quot; under admin/config/ting/settings)<br />
	Profile: [bibliotekets br&oslash;ndprofil] (Skal v&aelig;re det samme som i feltet &quot;Search profile&quot; under admin/config/ting/settings)<br />
	Max suggestions: 10<br />
	Max request time: 20000<br />
	Minimum string: 3</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<h2 id="søgning-på-indhold-i-hjemmesiden">S&oslash;g redaktionelt indhold p&aring; hjemmesiden</h2>

<p>Den tekniske underst&oslash;ttelse af s&oslash;gning p&aring; hjemmesiden varetages af modulet <strong>Search api</strong>.</p>

<p>Under /admin/config/search/search_api/index/default_multiple_index kan admin cleare indekset, samt s&aelig;tte sitet til at genindeksere. Har man meget indhold p&aring; hjemmesiden skal man dog v&aelig;re opm&aelig;rksom p&aring; at det tager tid at indeksere alt indholdet.</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2313/Search%20api%20view%20index.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Clearing af index: klik p&aring; Clear all index data</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2293/Search%20api%20indeksering2.jpg" style="border-width: 2px; border-style: solid;" /></p>

<p>Under /admin/config/search/search_api/index/default_multiple_index/fields kan admin konfigurere hvilke felter der skal indekseres. Default v&aelig;rdierne:</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2292/Search%20api%20indeksering1.jpg" style="border-width: 2px; border-style: solid;" /></p>

<h2>S&oslash;gning p&aring; arrangementer</h2>

<p><img alt="" data-rich-file-id="109" dir="ltr" src="/system/rich/rich_files/rich_files/000/000/109/original/arrangementer-soeg_dump1.PNG" style="border-width: 2px; border-style: solid;" /></p>

<p>P&aring; undersiden for arrangementer, ofte kaldet Arrangementer eller Det sker, er det muligt at frems&oslash;ge specifikke arrangementer ved at s&oslash;ge p&aring; ord, eller afgr&aelig;sne til bestemte datoer, og desuden filtrere ud fra nogle kategorier, eller hvor et materiale st&aring;r placeret.</p>

<p>Som standard vises arrangementerne grupperet efter m&aring;neder, men under /admin/config/ding_event/settings kan dette &aelig;ndres til at man gruppere efter dato.</p>

<h2 id="oversættelser">Overs&aelig;ttelser</h2>

<p>De fleste tekster i gr&aelig;nsefladen i DDB CMS kan overs&aelig;ttes ved at bruge den indbyggede overs&aelig;ttelsesfunktion.</p>

<h3 id="oversæt-tekst-i-grænsefladen.">Overs&aelig;t tekst i gr&aelig;nsefladen.</h3>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger - &gt; Overs&aelig;ttelser (under afsnittet &ldquo;Region og sprog&rdquo; (Sti: https://bibliotekets-hjemmesideadresse.dk/admin/config/regional/translate/translate).</li>
	<li>V&aelig;lg fanebladet &ldquo;Overs&aelig;t&rdquo;.</li>
	<li>Frems&oslash;g den tekststreng du &oslash;nsker at overs&aelig;tte. Bem&aelig;rk at du f&aring;r forskellige s&oslash;geresultater afh&aelig;ngig af, om du skriver store eller sm&aring; bogstaver i s&oslash;gningen.</li>
	<li>V&aelig;lg &ldquo;Rediger&rdquo; ud for den tekststreng, der &oslash;nsker at overs&aelig;tte.</li>
	<li>Inds&aelig;t din overs&aelig;ttelse.</li>
	<li>Klik p&aring; knappen &ldquo;Gem overs&aelig;ttelser&rdquo;.</li>
</ol>

<p>Lokale overs&aelig;ttelser overskrives ikke ved opdatering af den samme tekststreng i senere versioner af DDB CMS.</p>

<h3 id="import-og-eksport-af-oversættelsesfiler">Import og eksport af overs&aelig;ttelsesfiler</h3>

<p>Det er muligt at eksportere overs&aelig;ttelserne fra DDB CMS med henblik p&aring; backup eller gennemgang af overs&aelig;ttelserne i eksterne v&aelig;rkt&oslash;jer, der er s&aelig;rligt egnede til det job. Man kan f.eks. bruge POedit (http://poedit.net/) eller et lignende tekstbehandlingsprogram til at redigere overs&aelig;ttelsesfilerne. N&aring;r man eksportere overs&aelig;ttelserne i Drupal gemmes de i filformatet PO, deraf navnet POedit.</p>

<p>DDB CMS har to grupper af overs&aelig;ttelser repr&aelig;senteret ved &quot;Indbygget gr&aelig;nseflade&quot; og &quot;Felter&quot;. Begge skal enten eksporteres eller importeres efter hinanden.</p>

<p>Overs&aelig;ttelsen er inkluderet i DDB CMS, men l&oslash;bende opdateringer af master overs&aelig;ttelsen kan hentes fra:<br />
<a href="https://www.dropbox.com/s/sa6stp287nltoph/DDB%20CMS%20built-in%20interface.po?dl=0">DDB CMS indbygget gr&aelig;nseflade</a><br />
<a href="https://www.dropbox.com/s/9rey21t6fi4xwz9/DDB%20CMS%20fields.po?dl=0">DDB CMS felter</a><br />
<a href="https://www.dropbox.com/s/xs70bkn0qgtxrlg/DDB%20CMS%20metatags.po?dl=0">DDB CMS metatags</a></p>

<h3 id="eksporter-oversættelser.">Eksporter overs&aelig;ttelser.</h3>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger - &gt; Overs&aelig;ttelser -&gt; Eksport&eacute;r&rdquo; (Sti: admin/config/regional/translate/export).</li>
	<li>V&aelig;lg &ldquo;Indbygget gr&aelig;nseflade&rdquo; eller &ldquo;Felter&rdquo; under &ldquo;Eksport&eacute;r overs&aelig;ttelse&rdquo;.</li>
	<li>Tryk p&aring; knappen &ldquo;Eksport&eacute;r&rdquo;.</li>
</ol>

<h3 id="importer-oversættelser.">Importer overs&aelig;ttelser.</h3>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger - &gt; Overs&aelig;ttelser -&gt; Import&eacute;r&rdquo; (Sti: admin/config/regional/translate/import)</li>
	<li>V&aelig;lg under feltet &ldquo;Sprogfil&rdquo; den PO-fil for &ldquo;Indbygget gr&aelig;nseflade&rdquo; eller &ldquo;Felter&rdquo;, der skal importeres.</li>
	<li>V&aelig;lg &ldquo;Indbygget gr&aelig;nseflade&rdquo; eller &ldquo;Fields&rdquo; afh&aelig;ngig af hvilken gruppe af overs&aelig;ttelser, du &oslash;nsker at importere.</li>
	<li>V&aelig;lg under &ldquo;Tilstand&rdquo; radioknappen &quot;Eksisterende strenge og flertals-formatet bevares, kun nye strenge tilf&oslash;jes.&quot; for at undg&aring; at overskrive eksisterende lokale tilpasninger af overs&aelig;ttelserne. Bem&aelig;rk at nye overs&aelig;ttelser overskriver eksisterende overs&aelig;ttelser hvis du v&aelig;lger radioknappen &quot;Tekststrenge i den uploadede fil erstatter de eksisterende, mens nye tilf&oslash;jes. Flertalsformatet opdateres.&quot;</li>
	<li>Tryk p&aring; knappen &ldquo;Import&eacute;r&rdquo;.</li>
</ol>

<h2 id="mobilesearch-ding_mobilesearch">Nyheder arrangementer og karuseller til APP&#39;en</h2>

<p>APP&#39;en Biblioteket tr&aelig;kker nyheder, arrangementer og information om forsidekarusellen direkte fra DDB CMS.</p>

<p>Det g&oslash;r den fra &quot;Ding app content rss&quot; og &quot;Ding app variables&quot; modulerne som begge er aktiverede og ikke kr&aelig;ver konfiguration.</p>

<p>De to moduler kan testes under.</p>

<ul>
	<li>Arrangementer: [jeres staging-site URL] /ding-redia-rss/event</li>
	<li>Nyheder: [jeres staging-site URL] /ding-redia-rss/news</li>
	<li>Materialekarruseller: [jeres staging-site URL] /ding/variables</li>
</ul>

<h2>CMS Content til Mobilesearch (ding_mobilesearch)</h2>

<p>G&oslash;r det muligt automatisk at sende &aring;bningstider samt nyheder og arrangementer til den nye f&aelig;lles App.</p>

<p>Biblioteker p&aring; Redakt&oslash;rhostingplanen f&aring;r automatisk modulet aktiveret og konfigureret.</p>

<p>Biblioteker p&aring; Webmaster- og Programm&oslash;rhostingplanen skal:</p>

<ol>
	<li>kontakte DBC via https://kundeservice.dbc.dk og bede om API n&oslash;glen</li>
	<li>Logge ind med en administrator og inds&aelig;tte https://cmscontent.dbc.dk/ i feltet &quot;WS URL&quot; og API n&oslash;glen i feltet &quot;N&oslash;gle&quot; under Indstillinger &gt; Ding &gt; Content export &gt; plugins (Sti:&nbsp;/admin/config/ding/mobilesearch/content-export/plugin).</li>
	<li>&aelig;ndre WS URL til&nbsp;https://cmscontent-stg.dbc.dk/ for oprettelse af indhold under tekst p&aring; development- og stagingmilj&oslash;er.</li>
</ol>

<p><img alt="" data-rich-file-id="104" src="/system/rich/rich_files/rich_files/000/000/104/original/2017-10-05%2013_05_12-Content%20export%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Manglende konfiguration af modulet vil resultere i fejlmeddelelsen &quot;Problem connecting to the REST service. We have unchecked your &quot;Push to Mongo&quot; flag. Please check your&nbsp;<a href="https://hvidovre-dev.ddbcms.dk/admin/config/ding/mobilesearch/content-export/plugin">indstillinger</a>.&quot; eller p&aring; dansk &quot;DDB CMS kunne ikke f&aring; forbindelse til CMS Content servicen. Markeringen ved Send til CMS Content er fjernet. Unders&oslash;g venligst modulets indstillinger.&quot;</p>

<p>Nye nyheder, arrangementer og &aring;bningstider overf&oslash;res automatisk til den f&aelig;lles app via CMS Content servicen.</p>

<p>Man kan frav&aelig;lge at en nyhed eller et arrangement vises i app&#39;en, ved under fanen Flag i bunden af siden, at&nbsp;fjerne fluebenet i &quot;Send til CMS Content&quot;.</p>

<p>F&oslash;lgende feeds eksponerer indholdet:</p>

<ul>
	<li>https://vanilla-fbs.ddbcms.dk/ding/variables</li>
	<li>https://vanilla-fbs.ddbcms.dk/ding-redia-rss/event</li>
	<li>https://vanilla-fbs.ddbcms.dk/ding-redia-rss/news</li>
</ul>

<h2>Services modulet</h2>

<p>Services modulet g&oslash;r det muligt at udstille indhold, hvilket pt. omfatter nyheder og arrangementer, fra DDB CMS som en web service.</p>

<p>N&aring;r f&oslash;lgende moduler&nbsp;skal aktiveres:</p>

<ol>
	<li>rest_server (Medvirker aktivering af&nbsp;modulet&nbsp;&quot;Services&quot;)</li>
	<li>ding_services_news (Medvirker aktivering af&nbsp;&quot;Services Views&quot;)</li>
	<li>ding_services_events</li>
</ol>

<p>F&oslash;lgende endpoints eksponerer indholdet:</p>

<ul>
	<li>https://vanilla-fbs.ddbcms.dk/services/news_list</li>
	<li>https://vanilla-fbs.ddbcms.dk/services/event_list</li>
</ul>

<h2 id="e-resursemodul">E-resursemodul</h2>

<h3 id="opret-brugernes-adgangsmuligheder-for-de-enkelte-ressourcer.">Opret brugernes adgangsmuligheder for de enkelte resurser.</h3>

<ul>
	<li>Klik p&aring; Administration_Struktur-Taksonomi</li>
	<li>Klik p&aring; E-resource availability<img alt="" src="e-resursemodul_dump2.png" /></li>
	<li>Tilf&oslash;j ord. F. eks.
	<ul>
		<li>Adgang fra biblioteket</li>
		<li>Adgang hjemmefra</li>
		<li>Fri adgang<img alt="" src="e-resursemodul_dump3.png" /></li>
	</ul>
	</li>
</ul>

<h3 id="opret-kategorier-for-ressourcerne">Opret kategorier for ressourcerne</h3>

<ul>
	<li>Klik p&aring; Administration_Struktur-Taksonomi</li>
	<li>Klik p&aring; E-resource category</li>
	<li>Tilf&oslash;j ord. F. eks.
	<ul>
		<li>Aviser</li>
		<li>Film</li>
		<li>Magasiner<img alt="" src="e-resursemodul_dump4.png" /></li>
	</ul>
	</li>
</ul>

<h3 id="opret-den-enkelte-ressourcer">Opret den enkelte resurse</h3>

<ul>
	<li>Klik p&aring; tilf&oslash;j indhold og v&aelig;lg E-resource som indholdstype<img alt="" src="e-resursemodul_dump5.png" /></li>
	<li>Tilf&oslash;j indhold til de obligatoriske felter<img alt="" src="e-resursemodul_dump7.png" /></li>
</ul>

<p>Logoer i besk&aring;ret tilstand kan findes p&aring; <a href="https://centralbibliotek.dk/post/nye-logo-st%C3%B8rrelser-p%C3%A5-ddb-cms-e-resursemodulet">https://centralbibliotek.dk/post/nye-logo-st%C3%B8rrelser-p%C3%A5-ddb-cms-e-resursemodulet</a> (udarbejdet udf&oslash;rt af Rosa Andersen).</p>

<p>Oversigtsvisning af resurserne https://upgrade-fbs.ddbcms.dk/e-materialer<img alt="" src="e-resursemodul_dump8.png" /></p>

<p>Visning af den enkelte resurse (&ldquo;l&aelig;s mere&rdquo;) inkl. relateret materiale<img alt="" src="e-resursemodul_dump9.png" /></p>

<h3 id="forankring-af-e-ressourcemodulet-i-hovedmenustrukturen">Forankring af e-resursemodulet i (hoved)menustrukturen</h3>

<ul>
	<li>Klik p&aring; Hjem &raquo; Administration &raquo; Struktur &raquo; Menuer &raquo; Hovedmenu</li>
	<li>Klik p&aring; tilf&oslash;j link</li>
	<li>V&aelig;lg titel, eks.: E-resurser</li>
	<li>I feltet Sti, skrives:&nbsp;e-materialer</li>
</ul>

<h3>&AElig;ndring af teksten p&aring; e-resurse oversigtsvisningssiden</h3>

<p>Defaultteksten p&aring; /e-materialer siden kan &aelig;ndres under Indstillinger &gt; Ding &gt; eresurser (Sti: /admin/config/ding/eresource)</p>

<address>Som l&aring;ner ved Mariagerfjord Bibliotekerne har du fri adgang til en r&aelig;kke digitale tjenester som e-b&oslash;ger, lydb&oslash;ger, magasiner, temasider&nbsp;og film.<br />
​De fleste tjenester kan anvendes hjemmefra. For nogle af dem&nbsp;kr&aelig;ves, at du er bosat i Mariagerfjord Kommune, er oprettet som l&aring;ner p&aring; biblioteket&nbsp;og har en pinkode.</address>

<address><img alt="" src="e-resursemodul_dump10.png" /></address>

<h2 id="webstatistik">Webstatistik</h2>

<h3 id="webtrends">WebTrekk</h3>

<p>WebTrekk er folkebibliotekernes f&aelig;lles l&oslash;sning til opsamling og analyse af webstatistik. WebTrekk giver dels mulighed for lokalt at tilg&aring; egne statistiske data, dels leverer systemet statistik til Danmarks Biblioteksindeks: http://danmarksbiblioteksindex.dk/, som samler udvalgte webstatiske n&oslash;gletal fra folkebiblioteker i hele Danmark.</p>

<p>For at data fra hjemmesiden sendes til WebTrekk foruds&aelig;ttes konfiguration af WebTrekkmodulet i DDB CMS. Det er hensigtsm&aelig;ssigt at konfigurere Webtrekkmodulet f&oslash;r hjemmesiden s&aelig;ttes i drift, s&aring; det er muligt at se brugerstatistik fra hjemmesiden fra starten.</p>

<p>For de flestes vedkommende er dette sat op automatisk, men det er en god ide at kontrollere om ops&aelig;tningen er korrekt alligevel.</p>

<p>Indstillingen af modulet sker under &ldquo;Indstillinger -&gt; DING -&gt; WebTrekk&rdquo; (/admin/config/ding/webtrekk )</p>

<p>De forskellige felter herunder skal udfyldes p&aring; f&oslash;lgende m&aring;de:</p>

<ul>
	<li>Tracking dom&aelig;ne: responder.wt-safetag.com</li>
	<li>Tracking ID: 476651662471322</li>
</ul>

<p><strong>Registr&eacute;r kun bestemte bes&oslash;gende:</strong></p>

<p>Google Analytics modulet kan s&aelig;ttes op til kun at registrere bes&oslash;g fra anonyme brugere og borgere, der er logget ind. Det g&oslash;res p&aring; f&oslash;lgende m&aring;de:</p>

<ol>
	<li>&Aring;bn (/admin/config/system/googleanalytics).</li>
	<li>Under fanebladet &ldquo;Roller&rdquo; nederst p&aring; siden: S&oslash;rg for at checkboksen &ldquo;Tilf&oslash;j kun til de valgte roller&rdquo; er markeret under &ldquo;Tilf&oslash;j sporing af specifikke roller&rdquo;.</li>
	<li>Marker checkboksene &ldquo;Anonymous user&rdquo; og &ldquo;Provider&rdquo;.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<p><strong>Forslag til hj&aelig;lpetekst p&aring; siden help/lists:</strong></p>

<p><em><strong>Om at bruge lister</strong></em></p>

<p><em>Det er let at lave dine egne lister p&aring; biblioteket. Det kan v&aelig;re en liste med de b&oslash;ger, du skal l&aring;ne inden sommerferien, en liste med dine yndlingsgysere, julemusik, eller hvad du nu kan finde p&aring;.</em><br />
<em>Du kan ogs&aring; lave lister med materialer, du gerne vil huske til senere.</em></p>

<p><em>De lister, du laver, f&aring;r indflydelse p&aring; de forslag, biblioteket kommer med til dig p&aring; forsiden (DETTE UDELADES, HVIS SERENDIPITETSMODULET #Biblioteket foresl&aring;r materialer til dig&quot; IKKE ER SL&Aring;ET TIL).</em></p>

<p><em>Du tilf&oslash;jer et materiale til en liste under knappen &rdquo;Mere&hellip;&rdquo;, som du finder ved alle materialer. Du kan ogs&aring; v&aelig;lge at f&oslash;lge en forfatter eller en s&oslash;gning.</em></p>

<p><em>Du kan dele dine lister med andre og enten give dem lov til bare at kigge eller ogs&aring; til at redigere i dine lister. Denne funktion kan fx bruges, hvis du er i studiegruppe med nogen og I laver en f&aelig;lles litteraturliste.</em></p>

<h3 id="konfiguration-af-open-list">Konfiguration af OpenList</h3>

<p>Alle lister gemmes i den nationale listeservice OpenList.</p>

<h4 id="under-test-på-staging-miljø">Under test p&aring; staging milj&oslash;</h4>

<p>I test-perioden p&aring; staging er standardkonfigurationen af /admin/config/ding/provider/ting_openlist f&oslash;lgende:<br />
OPENLIST INDSTILLINGER</p>

<p>URI til WDSL *: https://test.openlist.ddbcms.dk/<br />
Bibliotekskode *: test</p>

<h4 id="i-drift-på-produktionsmiljø">I drift p&aring; produktionsmilj&oslash;</h4>

<p>I produktion skal konfigurationen af /admin/config/ding/provider/ting_openlist RETTES til f&oslash;lgende:<br />
OPENLIST INDSTILLINGER</p>

<p>URI til WDSL *: https://openlist.ddbcms.dk/<br />
Bibliotekskode *: [biblioteksnummer]</p>

<p>DBC h&aring;ndterer dette for Redakt&oslash;rbiblioteker. Programm&oslash;r- og Webmasterbiblioteker skal selv &aelig;ndre konfigurationen.</p>

<p>For at teste om der er &quot;hul igennem&quot; til open list, v&aelig;lg Hent statistik / Fetch Statistics. Der skal s&aring; komme et resultat med det samme.</p>

<p>Open List servicen har adgangsstyring p&aring; IP-niveau. Hvis Jeres bibliotek mod forventning ikke har adgang til servicen, skal f&oslash;lgende link anvendes til at anmode om whitelisting af bibliotekets CMS IP adresse: http://support.openlist.server003.b14cms.dk/</p>

<p>Efter stagingperioden nedl&aelig;gges http://v2_test.openlist.server003.b14cms.dk/?wsdl</p>

<p>Ved senere test p&aring; dev/stg./next-milj&oslash;&acute;er skal flg. url anvendes: http://test.openlist.ddbcms.dk/?wsdl (denne URI er ikke i drift p.t.)</p>

<p><em>V&aelig;r opm&aelig;rksom p&aring;, at ved skift fra &eacute;t openlist milj&oslash; til et andet overf&oslash;res data - dvs lister - ikke. Det vil sige at lister oprettet i et af test-milj&oslash;erne ikke overf&oslash;res til produktion.</em></p>

<h4 id="statistik-på-open-list">Statistik p&aring; Open List</h4>

<p>Det er muligt at hente en statistik over lister og items der er oprettet under bibliotekets agency.<br />
G&aring; ind under /admin/config/ding/provider/ting_openlist</p>

<p>Klik p&aring; &ldquo;Hent statistik&rdquo;</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2308/Open%20List%20hent%20statistik.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Eksempel p&aring; statistik:</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2312/Open%20List%20eksempel%20p%C3%A5%20statistik.png" style="border-width: 2px; border-style: solid;" /></p>

<h2>Arrangementer</h2>

<h3 id="arrangementer-konfigurér-om-prisen-skal-være-i-euro-i-stedet-for-kroner.">Arrangementer: Konfigur&eacute;r om prisen skal v&aelig;re i euro i stedet for kroner.</h3>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; sektionen &ldquo;Begivenheder&rdquo; -&gt; Ding event settings</li>
	<li>Marker checkboksen &ldquo;&euro;&rdquo;.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.<br />
	Ved oprettelse af en begivenhed (aka arrangement) er det muligt at angive en pris. Prisen er som udgangspunkt i kroner. &Oslash;nsker du at &aelig;ndre m&oslash;ntfoden til euro, g&oslash;res f&oslash;lgende:</li>
	<li>&Aring;bn &ldquo;Indstillinger -&gt; Event currency (under afsnittet &ldquo;Begivenheder&rdquo;)</li>
	<li>Marker checkboksen &ldquo;&euro;&rdquo;.</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2405/Events%20-%20currency.jpg" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="arrangementer-konfigurér-antal-arrangementer-på-forsiden">Arrangementer: Konfigur&eacute;r antal arrangementer p&aring; forsiden</h3>

<p>Det er muligt at konfigurere hvor mange arrangementer der maksimalt skal vises p&aring; forsiden. (kr&aelig;ver rollen admin eller lokaladmin)</p>

<ol>
	<li>G&aring; til /admin/config/ding_event/settings eller &Aring;bn &ldquo;Indstillinger -&gt; sektionen &ldquo;Begivenheder&rdquo; -&gt; Ding event settings</li>
	<li>Skriv det &oslash;nskede tal i &quot;Maximum number of events on the frontpage&quot;</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2404/Number%20of%20events%20on%20front%20page.jpg" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="place2book">Billetbestilling til arrangementer med Place2book</h3>

<p><em><a href="https://platform.dandigbib.org/projects/ddb-cms/wiki/Ddb-cms-manual_struktur-og-indhold_next-version#Place2Book-Send-en-begivenhed-arrangement-til-Place2Book">L&aelig;s ogs&aring; om Place2book i manualen Struktur og indhold.</a></em></p>

<p>Place2book er et eksternt online billetsystem, der anvendes af mange biblioteker til at modtage tilmeldinger- og s&aelig;lge billetter til arrangementer. Desuden er det via Place2Book muligt at eksportere oprettede arrangementer til www.kultunaut.dk.</p>

<p>Place2Book opkr&aelig;ver i forbindelse med salg af billetter via tjenesten et mindre billetgebyr, der som udgangspunkt betales af k&oslash;beren. Der vil desuden figurere reklamer p&aring; billetterne. Til geng&aelig;ld er det for arrang&oslash;ren som udgangspunkt gratis at anvende tjenesten. Information om andre prismodeller og aktuelle priser findes p&aring; place2book.com.</p>

<p>DDB CMS indeholder et Place2Book-modul, som giver mulighed for at integrere til tjenesten. For at integrere til Place2Book foruds&aelig;ttes, at du har oprettet en arrang&oslash;rprofil p&aring; place2book.com. N&aring;r der oprettes begivenheder i DDB CMS, der kr&aelig;ver tilmelding/betaling, fungerer integrationen til Place2Book ved at der automatisk bliver oprettet et tilsvarende arrangement i Place2Book. P&aring; den p&aring;g&aelig;ldende begivenhed p&aring; DDB CMS linkes der videre til arrangementet p&aring; Place2Book, hvor tilmelding og evt. betaling h&aring;ndteres.</p>

<p>For at aktivere Place2book-modulet skal biblioteker, der er tilmeldt redakt&oslash;rhostingplanen oprette en sag p&aring; opgaven hos DBC via http://kundeservice.dbc.dk. Webmasterbiblioteker s&oslash;rger selv for at aktivere og konfigurere modulet. Fremgangsm&aring;den for grundl&aelig;ggende konfiguration er beskrevet nedenunder:</p>

<h3 id="konfigurér-place2book-til-og-med-2017-1.-opgradering.">Konfigur&eacute;r Place2book</h3>

<ol>
	<li>&Aring;bn &ldquo;Indstillinger &gt; Place2book (under afsnittet &ldquo;Ding&rdquo;)&rdquo; (Sti: admin/config/ding/place2book).</li>
	<li>Indtast jeres unikke n&oslash;gle til Place2Book i feltet &ldquo;Place2Book standard API n&oslash;gle&rdquo; under fanen &ldquo;PLACE2BOOK TJENESTE&rdquo;. N&oslash;glen finder du under din arrang&oslash;rprofil/administrator n&aring;r du er logget ind p&aring; place2book.com (Se illustration nedenfor). Den fungerer som unik identifikator for den p&aring;g&aelig;ldende konto. Hvis jeres oprettede lokalbiblioteker har individuelle place2book-konti, er det muligt at lave ops&aelig;tning for de enkelte biblioteker under fanen &ldquo;BIBLIOTEKETS API N&Oslash;GLER&rdquo;. Det betyder at arrangementer oprettet af det enkelte lokalbibliotek kan tilknyttes det p&aring;g&aelig;ldende biblioteks egen Place2Book-konto. Hvis der ikke inds&aelig;ttes en n&oslash;gle for det enkelte bibliotek anvender modulet n&oslash;glen fra feltet &ldquo;Place2Book standard API n&oslash;gle&rdquo;.</li>
	<li>Klik p&aring; knappen &quot;Gem indstillinger&quot;.</li>
</ol>

<p>Du finder &quot;Place2Book standard API n&oslash;glen&quot; eller &quot;API token&quot; p&aring; place2book.com:<br />
<img alt="" src="http://platform.dandigbib.org/attachments/download/1435/place2bookAPI.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Er der flere Place2Book-konti i spil, kan de tilknyttede API-n&oslash;gler inds&aelig;ttes under &quot;BIBLIOTEKETS API N&Oslash;GLER&quot;:<br />
<img alt="" src="http://platform.dandigbib.org/attachments/download/1436/place2bookAPIIndividuelle.png" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="konfigurér-place2book-fra-2017-2.-opgradering.">Konfigur&eacute;r Place2book (F<strong>&oslash;rst g&aelig;ldende fra Release 31)</strong></h3>

<p>I DDB CMS 2017 2. opgradering har Place2book modulet gennemg&aring;et en omfattende udvikling til at underst&oslash;tte en ny version af Place2book API&#39;et.</p>

<p>Det betyder at I skal kontakte Place2book p&aring; bibliotek@place2book.com og bede om en ny API n&oslash;gle, som fremadrettet vil d&aelig;kke en eller flere arrang&oslash;rer (biblioteker) i stedet for at de som nu har hver deres.</p>

<p>I skal oplyse f&oslash;lgende:</p>

<ol>
	<li>Hvilke filialer skal have adgang?</li>
	<li>Hvilke filialer bruger allerede i dag DDB CMS integrationen til Place2Book?</li>
	<li>Er der nogen af filialerne, som i dag bruger Place2Book til billetsalg, men ikke via en integration med DDB CMS?</li>
	<li>Hvilke filialer bruger ikke Place2Book i dag men &oslash;nsker at blive oprettet?</li>
</ol>

<p>Herefter skal I konfigurere modulet og migrere arrangementerne til det nye Place2book API.</p>

<h4 id="api-nøgle">API n&oslash;gle <em> (F<strong>&oslash;rst g&aelig;ldende fra Release 31)</strong></em></h4>

<ol>
	<li>&Aring;bn &quot;Indstillinger &gt; Place2book indstillinger (under afsnittet &ldquo;Ding&rdquo;)&rdquo; (Sti: admin/config/ding/place2book).</li>
	<li>Indtast den unikke API n&oslash;gle I har modtaget efter henvendelse til bibliotek@place2book.com. API n&oslash;glen fungerer som unik identifikator for den p&aring;g&aelig;ldende Place2book konto.</li>
	<li>Klik p&aring; knappen &quot;Gem indstillinger&quot;.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2214/2016-12-06%2012_54_56-Place2book%20indstillinger%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="migrering-af-begivenheder-til-nyt-place2book-api">Migrering af begivenheder til nyt Place2book API <em> (F<strong>&oslash;rst g&aelig;ldende fra Release 31)</strong></em></h4>

<p>OBS: Ovenst&aring;ende trin til konfiguration af det nye Place2book API <strong>SKAL</strong> gennemf&oslash;res inden migrering aktiveres!</p>

<ol>
	<li>&Aring;bn &quot;Indstillinger &gt; Place2book indstillinger (under afsnittet &ldquo;Ding&rdquo;)&rdquo; &gt; Migrate (faneblad) (Sti: admin/config/ding/place2book/migrate).</li>
	<li>Tryk p&aring; Start knappen for at p&aring;begynde migrering af eksisterende begivenheder til det nye Place2book API.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2205/2016-12-06%2012_57_37-Place2book%20indstillinger%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="default-indstillinger">Default indstillinger</h4>

<ol>
	<li>&Aring;bn &quot;Indstillinger &gt; Place2book indstillinger (under afsnittet &ldquo;Ding&rdquo;)&rdquo; &gt; Standarder (faneblad) (Sti: admin/config/ding/place2book/defaults).</li>
</ol>

<ol>
	<li>Mark&eacute;r den filial der skal v&aelig;lges som default ved oprettelse af nye arrangementer (typisk hovedbiblioteket).</li>
	<li>Mark&eacute;r Vedligehold kopi hvis begivenheder som default skal overf&oslash;res til Place2book</li>
	<li>Mark&eacute;r Kultunaut eksport, hvis begivenheder som default skal overf&oslash;res til Kultunaut</li>
	<li>Mark&eacute;r Passivt arrangement, hvis begivenheder som default ikke skal p&aring;f&oslash;res en knap til billetsalg, f. eks. mhp. at sende begivenheder til Kultunaut uden at benytte Place2book, eller for at holde regnskab.</li>
	<li>Angiv det maksimale antal deltagere til begivenheder, der som default skal inds&aelig;ttes p&aring; nye begivenheder.</li>
	<li>Oplys navnet p&aring; den billettype der som default skal inds&aelig;ttes p&aring; nye begivenheder f. eks. Adgang, B&oslash;rn eller Voksne.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2211/2016-12-06%2012_56_31-Place2book%20indstillinger%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="mapning-af-filialer-til-event-makers">Mapning af Filialer til event makers<em> (F<strong>&oslash;rst g&aelig;ldende fra Release 31)</strong></em></h4>

<ol>
	<li>&Aring;bn &quot;Indstillinger &gt; Place2book indstillinger (under afsnittet &ldquo;Ding&rdquo;)&rdquo; &gt; Mappings (faneblad) (Sti: admin/config/ding/place2book/mappings).</li>
	<li>V&aelig;lg for hver filial den tilsvarende event maker som er oprettet i Place2book administrationsgr&aelig;nsefladen.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2207/2016-12-06%2012_56_55-Place2book%20indstillinger%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="mapning-af-event-target-taksonomien-til-kultunaut-age-group">Mapning af event target taksonomien til Kultunaut age group<em> (F<strong>&oslash;rst g&aelig;ldende fra Release 31)</strong></em></h4>

<ol>
	<li>&Aring;bn &quot;Indstillinger &gt; Place2book indstillinger (under afsnittet &ldquo;Ding&rdquo;)&rdquo; &gt; Mappings (faneblad) (Sti: admin/config/ding/place2book/mappings).</li>
	<li>V&aelig;lg for hver event target taksonomi term (Se /admin/structure/taxonomy/event_target) den tilsvarende Kultunaut age group.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2208/2016-12-06%2012_57_07-Place2book%20indstillinger%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h4 id="mapning-af-event-category-taksonomien-til-kultunaut-export-category">Mapning af event category taksonomien til Kultunaut export category&nbsp;<em>(F<strong>&oslash;rst g&aelig;ldende fra Release 31)</strong></em></h4>

<ol>
	<li>&Aring;bn &quot;Indstillinger &gt; Place2book indstillinger (under afsnittet &ldquo;Ding&rdquo;)&rdquo; &gt; Mappings (faneblad) (Sti: admin/config/ding/place2book/mappings).</li>
	<li>V&aelig;lg for hver event category taksonomi term (Se /admin/structure/taxonomy/event_category) den tilsvarende Kultunaut export category.</li>
</ol>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/2206/2016-12-06%2012_57_22-Place2book%20indstillinger%20_%20%E2%80%93%20Google%20Chrome.png" style="border-width: 2px; border-style: solid;" /></p>

<h2 id="spørg-biblioteksvagten">Sp&oslash;rg Biblioteksvagten</h2>

<p>Med &quot;Sp&oslash;rg Biblioteksvagten&quot; kan l&aring;nerne sende sp&oslash;rgsm&aring;l til<br />
Biblioteksvagten via en sp&oslash;rgeformular p&aring; hjemmesiden. Biblioteksvagten besvarer herefter sp&oslash;rgsm&aring;let eller videresender det til lokal besvarelse. Besvarelsen kan foreg&aring; via chat, sms eller e-mail. Sp&oslash;rgeformularen vises i et overlay p&aring; hjemmesiden:</p>

<p><img alt="" src="http://platform.dandigbib.org/attachments/download/1395/bibvagt4.png" style="border-width: 2px; border-style: solid;" /><br />
<img alt="" src="http://platform.dandigbib.org/attachments/download/1396/bibvagt5.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Alle biblioteker kan benytte Biblioteksvagtens sp&oslash;rgefunktion uden vederlag.</p>

<p>Brugerne kan aktivere sp&oslash;rgefunktonen fra enten en knap &rdquo;Sp&oslash;rg Biblioteksvagten&rdquo;, der vises nederst i DDB CMS vinduet eller fra et link i tekster eller billeder p&aring; sitet.</p>

<p>P&aring; http://biblioteksvagten.dk/om.asp?artid=21 findes bannere og knapper, der kan bruges som henvisning til Biblioteksvagten.</p>

<p>Har du sp&oslash;rgsm&aring;l som vejledningen nedenunder ikke besvarer, kan du kontakte Biblioteksvagtens webmaster Anders Nielsen, bibani@herning.dk.</p>

<h3 id="aktivér-spørgefunktionen">Aktiv&eacute;r sp&oslash;rgefunktionen</h3>

<p>Du skal igennem f&oslash;lgende trin for at aktivere sp&oslash;rgefunktionen:</p>

<ul>
	<li>Biblioteker, der er tilmeldt redakt&oslash;rhostingplanen skal kontakte http://kundeservice.dbc.dk for at f&aring; aktiveret Biblioteksvagten (ask_vopros) modulet.</li>
	<li>Send identifikationsnummer (se afsnittet &ldquo;Muligheder under Biblioteksvagten/Ask Vopros&rdquo; nedenunder) sammen med biblioteksnavn til Anders Nielsen, bibani@herning.dk. Biblioteksvagtenen vil herefter godkende, at der modtages sp&oslash;rgsm&aring;l fra den p&aring;g&aelig;ldende hjemmeside.</li>
	<li>Konfigur&eacute;r sp&oslash;rgefunktionen i DDB CMS (se nedenunder). For at kunne foretage indstillingerne skal du v&aelig;re logget ind som administrator.</li>
</ul>

<h3 id="konfigurér-spørgefunktionen-i-ddb-cms">Konfigur&eacute;r sp&oslash;rgefunktionen i DDB CMS:</h3>

<ul>
	<li>&Aring;bn &rdquo;Indstillinger &gt; Ask Vopros&rdquo; (Sti: admin/config/services/ask_vopros)</li>
	<li>Udfyld de forskellige felter efter behov (se beskrivelse af de enkelte felter i afsnittet &ldquo;Muligheder under &ldquo;Biblioteksvagten/Ask Vopros&rdquo; nedenunder).</li>
	<li>Klik p&aring; knappen &ldquo;Gem indstillinger&rdquo;.</li>
</ul>

<h3 id="muligheder-under-biblioteksvagtenask-vopros">Muligheder under &ldquo;Biblioteksvagten/Ask Vopros&rdquo;:</h3>

<p>Nedenfor er en kort beskrivelse af felter og konfigurationsmuligheder under &ldquo;Biblioteksvagten/Ask Vopros&rdquo;:</p>

<p><strong>Identifikationsnummer:</strong> Feltet er udfyldt p&aring; forh&aring;nd. Identifikationsnummeret best&aring;r af landekode og biblioteksnummer og skal opgives i forbindelse med aktivering af Biblioteksvagten p&aring; det p&aring;g&aelig;ldende site.</p>

<p><strong>Vopros URL:</strong><br />
Feltet er udfyldt p&aring; forh&aring;nd og skal ikke &aelig;ndres. N&aring;r l&aring;nerne stiller et sp&oslash;rgsm&aring;l til Biblioteksvagten sendes sp&oslash;rgsm&aring;lene til denne adresse.</p>

<p><strong>Lokal e-mail:</strong><br />
&ldquo;Lokal e-mail&rdquo; skal udfyldes med bibliotekets prim&aelig;re e-mailadresse. Det er den adresse Biblioteksvagten vil bruge til at sende sp&oslash;rgsm&aring;l videre til, hvis det er et sp&oslash;rgsm&aring;l, der kun eller bedst kan besvares lokalt.</p>

<p><strong>Override tab color:</strong><br />
Farven p&aring; fanebladet kan &aelig;ndres. Den valgte farve overskriver den gr&oslash;nne standardfarve. Farven skal angive som HEX-v&aelig;rdi.</p>

<p><strong>Defin&eacute;r h&oslash;jre margin:</strong><br />
&ldquo;Defin&eacute;r h&oslash;re margin&rdquo; udfyldes, hvis knappen nederst p&aring; siden skal flyttes i forhold til h&oslash;jre margin af browservinduet. Det kan v&aelig;re hvis knappen netop er i vejen for et lokalt telefonnummer el. lign. V&aelig;r opm&aelig;rksom p&aring; at tjekke at den valgte indstilling ogs&aring; fungerer, n&aring;r siden tilg&aring;s fra en mobil.</p>

<p><strong>Standardmetode til besvarelse:</strong><br />
Du v&aelig;lger selv om sp&oslash;rgeformularen skal &aring;bnes med chat, e-mail eller SMS som foretrukken sp&oslash;rge/svar-form. Biblioteksvagten anbefaler, at I v&aelig;lger &rdquo;E-mail&rdquo;.</p>

<p><strong>Vis blok p&aring; bestemte sider:</strong><br />
Her kan du v&aelig;lge hvor sp&oslash;rgeknappen skal vises.<br />
Hvis du v&aelig;lger &rdquo;Alle sider undtagen de n&aelig;vnte&rdquo; bliver knappen vist p&aring; alle sider.<br />
I de fleste tilf&aelig;lde vil det v&aelig;re hensigtsm&aelig;ssigt at ekskludere siderne: media/browser* da sp&oslash;rgeknappen her ikke har nogen funktion og ofte vil genere.<br />
Hvis I v&aelig;lger &rdquo;Kun de viste sider&rdquo; skal I angive, hvilke sider eller grupper af sider, der skal vise sp&oslash;rgeknappen.</p>

<p>Nederst p&aring; indstillingssiden er angivet jeres specifikke URL, der skal anvendes, hvis I vil &aring;bne sp&oslash;rgeboksen fra et link p&aring; en tekst eller et billede. Linket indeholder de n&oslash;dvendige oplysninger til Biblioteksvagten, s&aring; det fremg&aring;r, hvor sp&oslash;rgsm&aring;let kommer fra og den lokale kontakt-e-mail.</p>

<h2 id="ekurser">eKurser</h2>

<p>EKurser.nu er et site, som tilbyder et bredt udvalg af e-l&aelig;ringsforl&oslash;b produceret p&aring; danske folkebiblioteker. De kurser, du finder p&aring; eKurser.nu handler om emner som folkebibliotekerne traditionelt vejleder i p&aring; it-omr&aring;det. Det vil sige kurser i selvbetjeningsl&oslash;sninger fra det offentlige, bibliotekernes egne nettjenester, brug af computer, s&oslash;gning p&aring; internettet og andre muligheder p&aring; internettet, som kan have almen interesse.</p>

<p>Det er muligt at f&aring; vist kurser fra eKurser.nu direkte i DDB CMS via s&oslash;gninger og relationer p&aring; materialer og p&aring; en samlet kursusoversigter.</p>

<p>Nedenfor ses illustration af hvordan et kursus vises direkte p&aring; biblioteksposten. Kursusindholdet vises under afsnittet &quot;Materialets Indhold&quot;. Bem&aelig;rk at knappen &quot;Se online&quot; p&aring; posten stadig linker til kurset p&aring; ekurser.nu.<br />
<img alt="" src="http://platform.dandigbib.org/attachments/download/1497/ekurserPost.png" style="border-width: 2px; border-style: solid;" /></p>

<p>Nedenfor ses illustration af kursusoversigten:<br />
<img alt="" src="http://platform.dandigbib.org/attachments/download/1420/ekurser.png" style="border-width: 2px; border-style: solid;" /></p>

<h3 id="konfiguration-af-ekurser-for-webmaster--og-programmørbiblioteker">Konfiguration af eKurser for Webmaster- og programm&oslash;rbiblioteker</h3>

<p>Fremgangsm&aring;den for at f&aring; vist kursusoversigten er for webmaster- og programm&oslash;rbiblioteker f&oslash;lgende. Bem&aelig;rk at biblioteker med redakt&oslash;rhostingplanen skal f&oslash;lge vejledningen nedenunder.</p>

<ol>
	<li>Aktiv&eacute;r kilden eKurser som &quot;s&oslash;gning&quot; (og evt. som &quot;Relationer&quot;) i VIP (se evt. afsnittet &ldquo;Opret og konfigurer en br&oslash;ndprofil&rdquo; for mere info om VIP-konfiguration og br&oslash;ndprofiler).</li>
	<li>Aktiver modulet &quot;Ding eKurser&quot;.</li>
	<li>G&aring; ind p&aring; (Sti: https://bibliotekets-hjemmesideadresse.dk/ekurser) og bekr&aelig;ft at kursusoversigten er tilg&aelig;ngelig.</li>
	<li>Opret evt. et menupunkt der linker til kursusoversigten ved at f&oslash;lge vejledningen under http://platform.dandigbib.org/projects/ddb-cms/wiki/Manual_til_DDB_CMS#Sådan-tilføjer-du-et-menupunkt-til-hovedmenuen</li>
</ol>

<p>Fremgangsm&aring;de for at f&aring; vist et kursus direkte p&aring; biblioteksposten er for webmaster- og programm&oslash;rbiblioteker f&oslash;lgende:</p>

<ol>
	<li>Aktiv&eacute;r kilden eKurser som &quot;s&oslash;gning&quot; (og evt. som &quot;Relationer&quot;) i VIP (se evt. afsnittet &ldquo;Opret og konfigurer en br&oslash;ndprofil&rdquo; for mere info om VIP-konfiguration og br&oslash;ndprofiler).</li>
	<li>Aktiv&eacute;r modulerne &quot;Add oEmbed support to Ting objects&quot;, &quot;oEmbed&quot;, &quot;oEmbed Embed.ly&quot; og &quot;oEmbed Provider&quot;</li>
</ol>

<h3 id="konfiguration-af-ekurser-for-redaktørbiblioteker">Konfiguration af eKurser for redakt&oslash;rbiblioteker</h3>

<p>Fremgangsm&aring;den for at f&aring; vist kursusoversigten p&aring; (Sti: https://bibliotekets-hjemmesideadresse.dk/ekurser) er f&oslash;lgende:</p>

<ol>
	<li>Aktiv&eacute;r kilden eKurser som &quot;s&oslash;gning&quot; (og evt. som &quot;Relationer&quot;) i VIP (se evt. afsnittet &ldquo;Opret og konfigurer en br&oslash;ndprofil&rdquo; for mere info om VIP-konfiguration og br&oslash;ndprofiler).</li>
	<li>Opret et menupunkt der linker til kursusoversigten ved at f&oslash;lge vejledningen under http://platform.dandigbib.org/projects/ddb-cms/wiki/Manual_til_DDB_CMS#Sådan-tilføjer-du-et-menupunkt-til-hovedmenuen</li>
	<li>G&aring; ind p&aring; (Sti: https://bibliotekets-hjemmesideadresse.dk/ekurser) og bekr&aelig;ft at kursusoversigten er tilg&aelig;ngelig.</li>
</ol>

<p>Fremgangsm&aring;den for at aktivere visning af eKurser direkte i biblioteksposterne er f&oslash;lgende:</p>

<ol>
	<li>Aktiv&eacute;r kilden eKurser som &ldquo;S&oslash;gning&rdquo; (og evt. som &ldquo;Relationer&rdquo;) i VIP under korrekt br&oslash;ndprofil (se evt. afsnittet &ldquo;Opret og konfigurer en br&oslash;ndprofil&rdquo; for mere info om VIP-konfiguration og br&oslash;ndprofiler).</li>
	<li>Lav en pr&oslash;ves&oslash;gning p&aring; tilg&aelig;ngelige e-kurser og tjek at kurserne vises direkte i posten.</li>
</ol>

<h2 id="infomedia">Artikler fra Infomedia</h2>

<p>For deaktivering af Infomedia modulet skal feltet ting_infomedia slettes fra admin/structure/ting_object/fields. NB. det kr&aelig;ver administratorrettigheder, hvilket for Redakt&oslash;rhosrtingplansbiblioteker betyder at man skal kontakte DBC via https://kundeservice.dbc.dk.</p>

<h2 id="user-consent-samtykke">Administration</h2>

<h3 id="tilpas-siden-blev-ikke-fundet.">Tilpas &quot;siden blev ikke fundet&quot;.</h3>

<p>N&aring;r brugeren sender en foresp&oslash;rgsel p&aring; en webside til DDB CMS, som ikke eksisterer, vil brugeren automatisk blive omdirigeret til en side, der fort&aelig;ller, at den forespurgte side ikke findes.</p>

<p>Som udgangspunkt henviser DDB CMS i disse tilf&aelig;lde til f&oslash;lgende side (sti: https://bibliotekets-hjemmesideadresse.dk/siden-blev-ikke-fundet) med systemstien (sti: https://bibliotekets-hjemmesideadresse.dk/node/1). Denne side er defineret som &ldquo;Standard 404-side (ikke fundet)&rdquo; under (Sti: admin/config/system/site-information).</p>

<p>Teksten p&aring; &ldquo;Siden blev ikke fundet&rdquo; skal tilrettes s&aring; den passer til dit bibliotek (bl.a. henvises der som udgangspunkt til Odense Centralbibliotek). Da siden er en helt almindelige side-indholdstype, kan du redigere den p&aring; s&aelig;dvanlig vis, n&aring;r du er logget ind som administrator.</p>

<h2 id="skift-kodeordet-til-lokaladministrator">Skift kodeordet til lokaladministrator</h2>

<p>Skift kodeord:</p>

<ol>
	<li>Log ind med din ladmin-bruger (lokaladministrator) og tryk p&aring; &ldquo;Hej ladmin&rdquo; &oslash;verst til h&oslash;jre i administrationsmenuen.</li>
	<li>Tryk p&aring; fanebladet &ldquo;Redig&eacute;r brugerprofil&rdquo;.</li>
	<li>Indtast dit nuv&aelig;rende password i feltet &rdquo;Nuv&aelig;rende adgangskode&rdquo;.</li>
	<li>Indtast din nye adgangskode i feltet &rdquo;Adgangskode&rdquo; og gentag det i feltet &rdquo;Bekr&aelig;ft adgangskode&rdquo;.</li>
	<li>Tryk p&aring; knappen &quot;Gem&quot; nederst p&aring; siden.</li>
</ol>

<p>Glemt kodeord</p>

<ol>
	<li>Opret en sag i http://kundeservice.dbc.dk, og medsend den e-mail-adresse du bruger i DDB CMS. Du f&aring;r herefter tilsendt et link, som giver dig adgang til at nulstille dit kodeord.</li>
</ol>

<p>Bibliotekets Tekniske kontaktperson for DDB CMS har modtaget bruger og pinkode til den prim&aelig;re lokaladministrator. De &oslash;vrige redakt&oslash;rer opretter biblioteket selv.</p>

<ol>
</ol>

<h1 id="konfigurer-proxy-til-de-licensbelagte-elektroniske-ressourcer.">Konfigurer fjernadgang med proxy til de licensbelagte elektroniske ressourcer.</h1>

<p>Fjernadgangsproxy s&oslash;rger for adgangskontrollen til udvalgte licensbelagte ressource.<br />
Se <a href="https://platform.dandigbib.org/projects/ddb-cms/wiki/Proxyvejledning">Fjernadgang med proxy manualen </a>for yderligere information om hvordan DDB CMS kan konfigureres for at give brugerne adgang til de licensbelagte elektroniske ressourcer.</p>

<h3><strong>Cookie- og privatlivspolitik</strong></h3>

<p><em>Vi vil gerne tilbyde vores brugere en overskuelig og brugervenlig hjemmeside. For at sikre os, at indholdet p&aring; siden er relevant og til at finde rundt i, benytter vi os af cookies. Cookies giver os vigtige informationer om, hvordan vores side bliver brugt, hvilke sider der bliver set mest, hvor l&aelig;nge vores brugere bliver p&aring; siderne osv.</em></p>

<p><em>Hvad er en cookie?</em><br />
<em>En cookie er en lille tekstfil, der lagres i din browser for at kunne genkende din computer ved tilbagevendende bes&oslash;g. Cookies er ikke aktive filer; de kan alts&aring; ikke udvikle virus eller spore indhold p&aring; din computer. Det eneste, de g&oslash;r, er at sende anonyme oplysninger tilbage til os om fx bes&oslash;gstidspunkt, -varighed osv.</em></p>

<p><em>P&aring; denne hjemmeside bruger vi cookies til f&oslash;lgende form&aring;l:</em></p>

<p><em>Statistik: Vi bruger Google Analytics og Web</em>trekk<em> til at f&oslash;re statistik over trafikken p&aring; siden, s&aring;dan at vi bedst muligt kan tilpasse den brugernes behov. Vi f&aring;r blandt andet oplysninger om antal bes&oslash;g, gennemsnitlig bes&oslash;gsvarighed og f&aelig;rden rundt p&aring; siden.</em></p>

<p><em>Login: N&aring;r du logger ind for at se l&aring;nerstatus, reservere m.m. s&aelig;ttes en sessions-cookie. Denne cookie forsvinder n&aring;r du lukker browseren.</em></p>

<p><em>Hvis du ikke vil tillade cookies</em><br />
<em>Hvis du ikke vil tillade brugen af cookies p&aring; din computer, kan du &aelig;ndre i indstillingerne i din browser, s&aring; den husker det fremover. Du kan ogs&aring; slette cookies, der allerede er lagret.</em><br />
<em>Se vejledning og l&aelig;s mere om cookies p&aring; http://minecookies.org/cookiehandtering.</em><br />
<em>V&aelig;r opm&aelig;rksom p&aring;, at du ved at sp&aelig;rre for cookies besv&aelig;rligg&oslash;r brugen af hjemmesiden.</em></p>

<p><em>Brug af personoplysninger</em><br />
<em>Personoplysninger bliver p&aring; intet tidspunkt videregivet eller solgt til tredjepart, og vi indsamler ikke personoplysninger, uden du selv har givet os disse.</em></p>

<p><em>For at tilbyde en bedre brugeroplevelse kan du dele indhold fra vores hjemmeside p&aring; sociale medier, som Facebook og Twitter. N&aring;r du deler indholdet, kan du forvente tredjeparts-cookies.</em></p>

<h3><em>Hvad er tredjeparts-cookies?</em></h3>

<p><em>Tredjeparts-cookies afs&aelig;ttes p&aring; din computer af en tredjepart, som har elementer p&aring; vores hjemmeside. Tredjeparts-cookies s&aelig;ttes p&aring; din computer til markedsf&oslash;rings- og statistikform&aring;l for de respektive leverand&oslash;rers hjemmeside. Hvis tredjeparts-cookies bekymrer dig, kan disse deaktiveres i din browser.</em>_</p>
